{"story": ["Matthew keeps reading a bedtime story to his son despite the blackout."], "answer": ["Matthew was blind and he usually read bedtime stories to his son from a braille book. That night there was a blackout, but this did not stop him from finishing the story."], "story_keys": "['Matthew reads a bedtime story to his son', 'There is a blackout', 'He continues to read despite the blackout.']", "answer_keys": "- Matthew is blind and reads bedtime stories to his son from a braille book.\n- There was a blackout one night, but he continued reading the story.", "likes": "86% users", "solving_time": "4 minutes", "level": "2/10 Easy", "date": "04 March 2018"}
{"story": ["A black cat is walking through the middle of a road where there is a broken street lamp. A man is driving his vehicle with headlights that do not work. Despite all of this, he is able to avoid harming the cat."], "answer": ["The man avoided the cat because it was daylight."], "story_keys": "1. A black cat is walking in the middle of the road near a broken street lamp.\n2. A man is driving his vehicle with non-functioning headlights.\n3. Despite the low visibility, the man successfully avoids hitting the cat.", "answer_keys": "- A man avoided a cat during daylight.", "likes": "85% users", "solving_time": "4 minutes", "level": "2/10 Easy", "date": "17 March 2018"}
{"story": ["A woman is watching a movie. Suddenly she hears a lot of explosions and people screaming outside. Then there is silence. The woman turns off the TV and goes to sleep. "], "answer": ["It was New Year's Eve. The woman waited until everyone had finished celebrating and then went to bed."], "story_keys": "1. A woman is watching a movie.\n2. She hears explosions and screaming outside.\n3. Afterwards, there is silence.\n4. She turns off the TV and goes to sleep.", "answer_keys": "- It was New Year's Eve.\n- A woman waited for everyone to finish celebration.\n- After everyone was done celebrating, the woman went to bed.", "likes": "83% users", "solving_time": "4 minutes", "level": "2/10 Easy", "date": "04 January 2018"}
{"story": ["John was walking along the snow-covered field. When he came to a lonely tree, he saw the corpse of a man hanging on the tree. He died the last night from strangulation, but there were no traces around him, except John's ones. "], "answer": ["The hanged man was a skydiver. His parachute was entangled and caught on branches of the tree."], "story_keys": "1. John was walking along a snow-covered field.\n2. He found a man's corpse hanging on a lonely tree.\n3. The man died the previous night from strangulation.\n4. There were no traces around him except for John's.", "answer_keys": "- The man who hanged was a skydiver.\n- His parachute got entangled and caught on the branches of a tree.", "likes": "81% users", "solving_time": "7 minutes", "level": "3/10 Easy", "date": "18 January 2018"}
{"story": ["Tony ran out of the building, carrying two bags. Another man ran after him, shouting and waving knives."], "answer": ["Tony was shopping in the store, he spent a lot of money, so the shop workers decided to give him a gift: a set of kitchen knives. Tony was in a hurry so he ran to his car, forgetting about it. The worker noticed this and ran after Tony to give him the gift. "], "story_keys": "1. Tony ran out of a building with two bags.\n2. Another man chased Tony, shouting and waving knives.", "answer_keys": "['Tony was shopping and spent a lot of money at the store', 'Workers at the store decided to gift Tony a set of kitchen knives', 'Tony accidentally left his gift behind', 'A store worker noticed and ran after Tony to give him his forgotten gift.']", "likes": "80% users", "solving_time": "8 minutes", "level": "3/10 Easy", "date": "18 January 2018"}
{"story": ["Michael applaused, and everyone in the room (except him) died. What happened? "], "answer": ["Michael was killing mosquitoes. "], "story_keys": "1. Michael applauded.\n2. Everyone in the room except Michael died.\n3. Context or further detail about what happened is not provided.", "answer_keys": "- Michael was killing mosquitoes.", "likes": "80% users", "solving_time": "11 minutes", "level": "3/10 Easy", "date": "10 February 2018"}
{"story": ["Visitors to a scenic mountain village were often amused by the village idiot. When offered a choice between a shiny 50-cent piece and a crumpled $5 bill, he would always happily choose the half-dollar. The bill was worth ten times as much, so why did he never choose it?"], "answer": ["The so-called village idiot was smart enough to realize that as long as he kept choosing a 50-cent piece, people would keep offering him the choice. If he took the $5 bill once, the stream of coins would stop rolling in."], "story_keys": "- The village idiot in a scenic mountain village always chooses a shiny 50-cent piece over a crumpled $5 bill.\n- Despite the $5 bill being worth ten times more than the 50-cent piece, the village idiot never chooses it.", "answer_keys": "-The village idiot cleverly maintains a continuous stream of 50-cent pieces by always choosing them over a $5 bill, realizing if he took the $5 bill, he would no longer be offered money.", "likes": "80% users", "solving_time": "6 minutes", "level": "3/10 Easy", "date": "10 February 2018"}
{"story": ["A woman is looking through the window and sees a man with a knife. However, she does not have enough time to call the police before being murdered."], "answer": ["What the woman really saw was the reflection of the murderer, who was already inside her house, behind her."], "story_keys": "- A woman is looking through a window and spots a man with a knife\n- She doesn't have enough time to alert the police\n- She is murdered.", "answer_keys": "The woman saw the reflection of the murderer who was already inside her house and behind her.", "likes": "80% users", "solving_time": "6 minutes", "level": "3/10 Easy", "date": "04 March 2018"}
{"story": ["A man was furious, when he realized that he can hear better without hearing aid that he was using the last 20 years. He went to his doctor to complain but the specialist became even more furious than him."], "answer": ["The man was wearing the hearing aid on his healthy ear."], "story_keys": "1. A man discovered he could hear better without his hearing aid which he had been using for the past 20 years.\n2. He went to his doctor to complain about the situation.\n3. Instead of understanding, the doctor becomes even more furious than the man.", "answer_keys": "- A man was wearing a hearing aid on his healthy ear.", "likes": "80% users", "solving_time": "3 minutes", "level": "3/10 Easy", "date": "03 March 2018"}
{"story": ["An exotic dancer goes on a date for a private session with a man. In the room where they are, she takes her shirt and bra off. The man approaches, watches her breasts and smiles. Soon after, she dresses herself up, pays the man and leaves."], "answer": ["The woman had undergone a breast augmentation surgery a few days earlier and she had arranged an appointment with her private doctor to review the result of the operation. The man saw that everything was perfect and that he had done a great job. Finally the woman paid the bill and left the clinic."], "story_keys": "1. An exotic dancer goes on a private date with a man.\n2. In their private room, she removes her shirt and bra.\n3. The man watches her undress and smiles.\n4. After a while, she dresses up, pays the man and leaves.", "answer_keys": "1. The woman had a breast augmentation surgery a few days earlier.\n2. She arranged an appointment with her private doctor to review the operation's result.\n3. The doctor found that the surgery was successful and he did a great job.\n4. The woman paid the bill and left the clinic.", "likes": "80% users", "solving_time": "7 minutes", "level": "2/10 Easy", "date": "17 March 2018"}
{"story": ["Five pieces of coal, a carrot and a scarf are lying on the lawn. Nobody put them on the lawn but there is a perfectly logical reason why they should be there. What is it?"], "answer": ["They were used by children who made a snowman. The snow has now melted."], "story_keys": "- Five pieces of coal, a carrot, and a scarf are found on the lawn.\n- No one intentionally put them there.\n- There's a logical reason for their presence. The sentence asks for this logical reason.", "answer_keys": "- Children used them to make a snowman.\n- The snow has now melted.", "likes": "80% users", "solving_time": "1 minute", "level": "2/10 Easy", "date": "03 September 2022"}
{"story": ["A couple enters a grand ballroom only to find the occupants are dead. There has been no crime committed. The couple is not concerned by what they have found. How is this possible?"], "answer": ["The couple is scuba diving on a sunken cruise ship. The occupants in the ballroom had drowned when the ship sank suddenly in a terrible disaster at sea."], "story_keys": "1. A couple enters a grand ballroom.\n2. They find the occupants are dead.\n3. There's no crime committed.\n4. The couple is not concerned by what they found.\n5. The paragraph is posed as a riddle asking how this situation is possible.", "answer_keys": "1. A couple is scuba diving on a sunken cruise ship.\n2. The ship had occupants in the ballroom at the time it sank.\n3. The occupants drowned because of the abrupt sinking.\n4. The sinking of the ship is referred to as a terrible disaster at sea.", "likes": "80% users", "solving_time": "7 minutes", "level": "3/10 Easy", "date": "06 November 2023"}
{"story": ["Roger sees the light and he becomes paralyzed. Soon after that he dies."], "answer": ["Roger was a rabbit that escaped from the house where he lived. He was crossing the road at night when the lights of a car blinded him. The driver did not see him and ran him over."], "story_keys": "- Roger saw light and became paralyzed.\n- Roger died soon after becoming paralyzed.", "answer_keys": "- Roger is a rabbit who escaped from his house.\n- He was crossing the road at night.\n- The lights of a car blinded him.\n- The car driver did not see Roger.\n- The car ran Roger over.", "likes": "79% users", "solving_time": "8 minutes", "level": "2/10 Easy", "date": "04 March 2018"}
{"story": ["A man kills his brother in front of a crowd of people. However, no one reports him."], "answer": ["The man worked as executioner and his brother had been sentenced to death."], "story_keys": "1. A man murders his brother publicly.\n2. The incident happens in front of a crowd. \n3. Nobody reports the man's crime.", "answer_keys": "1. The man is employed as an executioner.\n2. The man's brother has been sentenced to death.", "likes": "79% users", "solving_time": "6 minutes", "level": "3/10 Easy", "date": "03 March 2018"}
{"story": ["A man jumped out of plane. And he survived."], "answer": ["The plane wasn't flying."], "story_keys": "- A man jumped out of a plane\n- He survived the jump.", "answer_keys": "The plane was not in the air.", "likes": "78% users", "solving_time": "1 minute", "level": "1/10 Easy", "date": "04 March 2018"}
{"story": ["A woman asks a driver to take her home. The whole way she talks, too much. The taxist tells her: \"I'm sorry but I am deaf.\" The woman falls silent. But when she goes out of the taxi, she understands that the driver isn't deaf."], "answer": ["The taxist have heard and understood where her house was."], "story_keys": "1. A woman requests a taxi driver to take her home.\n2. The woman talks excessively throughout the trip.\n3. The taxi driver informs her that he is deaf.\n4. The woman stops talking after being told by the driver he's deaf.\n5. When the woman leaves the taxi, she realizes the driver is not actually deaf.", "answer_keys": "The taxi driver has understood the location of her house.", "likes": "77% users", "solving_time": "8 minutes", "level": "2/10 Easy", "date": "04 March 2018"}
{"story": ["Michael is in prison. One day, he has luch, goes to prison courtyard for a while and finally visits the library. At dusk, out of the reach of the security cameras, he changes his clothes. He then goes through the door to leave the prison, without being caught."], "answer": ["Michael worked as a guard in the prison."], "story_keys": "- Michael is in prison.\n- He has lunch, goes to the prison courtyard, and visits the library in one day.\n- At dusk, he changes his clothes out of the reach of security cameras.\n- Michael then leaves the prison without being caught.", "answer_keys": "['Michael', 'worked', 'guard', 'prison']", "likes": "76% users", "solving_time": "6 minutes", "level": "1/10 Easy", "date": "04 January 2018"}
{"story": ["After careful planning, five men break into a house and take thousands of dollars in cash from it. The owner of the house is the only person arrested. "], "answer": ["The five men were policemen and they had an arrest warrant to enter a mobster's house and take all his money. After planning the assault, they arrested the house's owner."], "story_keys": "1. Five men carefully planned and executed a break-in into a house.\n2. They stole thousands of dollars in cash from that house.\n3. The owner of the house was the only person arrested following the incident.", "answer_keys": "1. Five men are policemen.\n2. The policemen have an arrest warrant to enter a mobster's house.\n3. They plan to confiscate all the mobster's money.\n4. After planning their assault, they arrested the mobster, who is the house's owner.", "likes": "75% users", "solving_time": "13 minutes", "level": "3/10 Easy", "date": "17 March 2018"}
{"story": ["A deaf man came into a store to pick up flowers he ordered for his beloved wife. How did he explain that he needs to pick up the flowers that he ordered before?"], "answer": ["He just said it. He is deaf, but not mute."], "story_keys": "A deaf man came into a store to pick up flowers he had previously ordered for his wife.", "answer_keys": "The key point is: He is deaf but not mute.", "likes": "75% users", "solving_time": "5 minutes", "level": "1/10 Easy", "date": "18 January 2023"}
{"story": ["A man is replacing a wheel on his car, when he accidentally drops the four nuts used to hold the wheel on the car, and they fall into a deep drain, irretrievably lost. A passing girl offers him a solution which enables him to drive home. What is it? (keep you mind out of the drain)"], "answer": ["Use one nut from each of the four other wheels."], "story_keys": "1. A man is replacing a wheel on his car.\n2. Accidentally, he drops the four nuts used to hold the wheel into a deep drain and loses them.\n3. A girl passing by offers him a solution that allows him to drive home.", "answer_keys": "- Use one nut from each of the four other wheels.", "likes": "75% users", "solving_time": "3 minutes", "level": "2/10 Easy", "date": "19 January 2023"}
{"story": ["The sound of Brian’s snoring is usually just annoying, but today it causes terror and panic. Why?"], "answer": ["Brian is a bus driver."], "story_keys": "-The sound of Brian's snoring usually is annoying but today it is causing terror and panic.", "answer_keys": "['Brian', 'bus driver']", "likes": "75% users", "solving_time": "4 minutes", "level": "3/10 Easy", "date": "23 July 2023"}
{"story": ["A woman - at work - is going downstairs, when suddenly there is a blackout. In that very moment she realizes that her husband is about to die. "], "answer": ["The woman worked as an electrician at a hospital and she knew that the emergency generators were broken. He husband had had a car crash and he was at that hospital, connected to a machine that kept him alive. When the blackout happened she knew that her husband couldn't be breathing by himself and therefore that he was dying. "], "story_keys": "1. A woman is at work and going downstairs.\n2. There is a sudden blackout.\n3. At that moment, she realizes her husband is about to die.", "answer_keys": "1. The woman is an electrician working at a hospital.\n2. The emergency generators at the hospital were broken.\n3. Her husband was in the same hospital after a car crash, relying on a machine for breathing.\n4. During a blackout, she realized that without a functioning generator, her husband was at risk of dying as he couldn't breathe naturally.", "likes": "73% users", "solving_time": "5 minutes", "level": "3/10 Easy", "date": "04 January 2018"}
{"story": ["A woman is found dead in a hospital. The murder weapon is a pair of scissors. However, the body has no cuts ot wounds of any kind."], "answer": ["The woman's condition was critical, and the doctors had connected her to a device that kept her alive. The murderer simply cut the wires off that device with scissors to end her life. "], "story_keys": "1. A woman is found dead in a hospital.\n2. The murder weapon is a pair of scissors.\n3. The body has no cuts or wounds.", "answer_keys": "1. The woman's condition was critical.\n2. She was attached to a life-supporting device.\n3. The murderer ended her life by cutting the wires of the device with scissors.", "likes": "73% users", "solving_time": "7 minutes", "level": "2/10 Easy", "date": "17 March 2018"}
{"story": ["He was very calm. However, they kept beating him until he screamed. After that, she was happy. Why?"], "answer": ["The girl has just given birth to a son."], "story_keys": "1. The man remained calm while being beaten.\n2. Despite his calmness, he was continued to be beaten until he screamed.\n3. A woman was happy after the man screamed.\n4. The reason for the woman's happiness is questioned.", "answer_keys": "- The girl has recently become a mother to a son.", "likes": "73% users", "solving_time": "28 minutes", "level": "3/10 Easy", "date": "05 February 2022"}
{"story": ["A man is found hanging in an otherwise empty locked room with a puddle of water under his feet."], "answer": ["He stood on a block of ice to hang himself."], "story_keys": "1. A man is found hanging in a locked room.\n2. The room is otherwise empty.\n3. There is a puddle of water under the man's feet.", "answer_keys": "- A man attempted suicide by standing on a block of ice to hang himself.", "likes": "73% users", "solving_time": "7 minutes", "level": "3/10 Easy", "date": "07 February 2022"}
{"story": ["Four college students were late for a lecture and explained it to the lecturer by having a flat tire. The smart lecturer quickly proved to the rest of the audience that the latecomers had lied. How?"], "answer": ["The lecturer took all four latecomers to different rooms and asked each of them, on which of the car’s wheels the flat tire was. Of course, they gave different answers."], "story_keys": "- Four college students arrived late to a lecture.\n- They explained their lateness by claiming they had a flat tire.\n- The lecturer was able to prove to the audience that the students had lied.", "answer_keys": "- The lecturer separated four latecomers into different rooms.\n- He asked each of them which car wheel had the flat tire.\n- Each individual gave a different answer.", "likes": "72% users", "solving_time": "9 minutes", "level": "3/10 Easy", "date": "13 March 2021"}
{"story": ["A dying man gives another man a gift, and then the dying man dies. Shortly after that the second man dies. How come?"], "answer": ["The second man had shot the first man. Before he dies, the first man gives the second man a grenade pin, which he's of course just pulled from a grenade. The first man dies, then the grenade explodes and the second man dies."], "story_keys": "1. A dying man gives a gift to another man.\n2. The man who gave the gift dies.\n3. Shortly after, the second man also dies.", "answer_keys": "1. The second man shoots the first man.\n2. The dying first man hands a pulled grenade pin to the second man.\n3. The first man dies.\n4. The grenade explodes, leading to the death of the second man.", "likes": "71% users", "solving_time": "10 minutes", "level": "3/10 Easy", "date": "19 January 2022"}
{"story": ["A couple find a man's corpse on the beach. The corpse is under an umbrella and has a knife on his back. There are no signs of violence and no traces of blood. The autopsy reveals that the man died of natural causes. "], "answer": ["The man, who had a tattoo of a knife on his back, died of a heart attack."], "story_keys": "1. A couple discovers a man's corpse on the beach.\n2. The corpse is found under an umbrella with a knife on his back.\n3. There are no signs of violence or traces of blood found near the corpse.\n4. Autopsy results show that the man died of natural causes.", "answer_keys": "- The man had a tattoo of a knife on his back.\n- The man died of a heart attack.", "likes": "70% users", "solving_time": "6 minutes", "level": "3/10 Easy", "date": "04 January 2018"}
{"story": ["The man was going to go to work by car, but found that one of the tires was flat. Without doing anything, he got into the car and drove 20 kilometers to work and then back home, without the slightest embarrassment. How could he manage it?"], "answer": ["The tire was flat on the spare wheel, which was in the trunk."], "story_keys": "- The man intended to go to work by car.\n- One of the car's tires was flat.\n- Despite the flat tire, the man still drove the car 20 kilometers to work and back home.\n- He did this without embarrassment.\n- The text raises question about how he managed to do this.", "answer_keys": "The spare wheel in the trunk had a flat tire.", "likes": "68% users", "solving_time": "10 minutes", "level": "2/10 Easy", "date": "18 January 2018"}
{"story": ["How do you get a full-grown pear inside a bottle of brandy?"], "answer": ["It may be easier than putting a ship in a bottle but requires just as much patience. The pear isn’t put into the bottle; it grows inside it. When the fruit is small, the bottle is affixed to the tree branch, and the pear grows to maturity inside the bottle."], "story_keys": "The key point is: inquiry about getting a full-grown pear inside a bottle of brandy.", "answer_keys": "1. The process of growing a pear inside a bottle, while easier than putting a ship in a bottle, still requires patience.\n2. The pear is not placed inside the bottle, but grows inside it. \n3. When the fruit is small, the bottle is attached to the tree branch and the pear matures within the bottle.", "likes": "68% users", "solving_time": "5 minutes", "level": "2/10 Easy", "date": "10 February 2018"}
{"story": ["A man returns from a business trip, he rings a door, his wife opens it. He immediately accused her of betrayal."], "answer": ["On the way back home, this man decided to visit his friend. And the door was opened by his own half-dressed wife."], "story_keys": "1. A man returns from a business trip.\n2. He rings a door upon his return.\n3. His wife is the one opening the door.\n4. The man immediately accuses his wife of betrayal.", "answer_keys": "1. A man decided to visit his friend while returning home.\n2. The door was opened by his own half-dressed wife.", "likes": "67% users", "solving_time": "4 minutes", "level": "2/10 Easy", "date": "18 January 2018"}
{"story": ["A mother-in-law disliked her son-in-law so much that she wanted to poison him. But the son-in-law was careful and always ate only what his mother-in-law ate. Over dinner one night, the mother-in-law cut a piece of meat in half, ate one half herself, and gave the other to her son-in-law. After that he died. How did she manage to do it?"], "answer": ["She greased one side of the knife with poison."], "story_keys": "- The mother-in-law dislikes her son-in-law.\n- She wants to poison him.\n- The son-in-law always ate what his mother-in-law ate, as a caution.\n- One night, the mother-in-law cut a piece of meat in half, ate one half, and gave the other to the son-in-law.\n- The son-in-law died after eating the meat.", "answer_keys": "- The subject, a woman, is applying poison to one side of a knife.", "likes": "66% users", "solving_time": "4 minutes", "level": "3/10 Easy", "date": "09 February 2020"}
{"story": ["A woman entered a building accompanied by a man whom she loves very much. But she left the building with another man, whom she loves very much. What happened?"], "answer": ["A woman is getting married. Her father brought her to church, and she leaves the church with her husband."], "story_keys": "- A woman entered a building with a man she loves very much.\n- She later left the building with a different man, whom she also loves very much. \n- The situation/events that transpired within the building are unknown.", "answer_keys": "1. A woman is getting married.\n2. Her father brought her to the church.\n3. She leaves the church with her husband.", "likes": "66% users", "solving_time": "1 minute", "level": "1/10 Easy", "date": "02 February 2022"}
{"story": ["I was having dinner with my friend and he said to find a hidden place so that he would not be seen. After a while, my friend exploded."], "answer": ["My friend and I are mosquitoes, and in the middle of sucking blood, my friend was slapped to death by a human, so he exploded."], "story_keys": "1. The speaker was having dinner with a friend.\n2. The friend asked to find a hidden place where he wouldn't be seen.\n3. After some time, the friend exploded.", "answer_keys": "1. The narrator and their friend are mosquitoes.\n2. They were in the process of sucking blood.\n3. The friend mosquito was killed by a human slapping it.\n4. The friend mosquito exploded as a result of the slap.", "likes": "63% users", "solving_time": "8 minutes", "level": "3/10 Easy", "date": "20 November 2021"}
{"story": ["A magician is standing on a concrete floor holding a raw egg with his hand outstretched. Without the aid of any objects, he is able to drop the egg two feet without breaking it's shell. How does he do it?"], "answer": ["He simply holds the egg higher than two feet, and then releases the egg. The first two feet it will fall without breaking."], "story_keys": "- A magician is standing on a concrete floor.\n- He is holding a raw egg with his hand outstretched.\n- Without using any objects, he drops the egg two feet without breaking it's shell.\n- The text is asking how the magician managed to do this.", "answer_keys": "- The individual holds the egg higher than two feet.\n- The egg is then released.\n- The egg will not break for the initial two feet it falls.", "likes": "60% users", "solving_time": "4 minutes", "level": "1/10 Easy", "date": "06 November 2023"}
{"story": ["A man looked out of the window and soon died. What happened?"], "answer": ["Through the window of his car, he saw a pretty woman and had a fatal accident."], "story_keys": "- A man looked out of the window.\n- The man soon died. \n- The reason for his death is not given.", "answer_keys": "1. The man observed a pretty woman through his car window.\n2. He then had a fatal accident.", "likes": "50% users", "solving_time": "5 minutes", "level": "3/10 Easy", "date": "02 February 2022"}
{"story": ["A horse is tied to a 15 ft. rope and there is a bail of hay 25 ft. away from him, yet the horse is able to eat from the bail of hay. How is this possible?"], "answer": ["The horse is ties to one end of the rope but the other end of the rope is not tied to anything so the horse walks over and eats the hay."], "story_keys": "- A horse is tied to a 15 ft. rope.\n- There is a bail of hay 25 ft. away from the horse.\n- The horse is able to eat from the bail of hay.", "answer_keys": "1. A horse is tied to one end of a rope.\n2. The other end of the rope is not tied to anything.\n3. The horse walks over and eats the hay.", "likes": "50% users", "solving_time": "1 minute", "level": "1/10 Easy", "date": "06 November 2023"}
{"story": ["A New York city hairdresser recently said that he would rather cut the hair of 3 Canadians rather than cut the hair of one New Yorker. Why?"], "answer": ["He would rather earn three times as much money!"], "story_keys": "- A New York city hairdresser expressed preference for cutting the hair of 3 Canadians over one New Yorker. Reasons for this preference are not explained.", "answer_keys": "The person prefers to earn money that is three times his current earnings.", "likes": "50% users", "solving_time": "2 minutes", "level": "3/10 Easy", "date": "06 November 2023"}
{"story": ["A man drives down the motorway at 70 miles per hour. He passes three cars going 80 miles per hour, then gets pulled over by a police officer and is given a ticket."], "answer": [], "story_keys": "- A man is driving down the motorway at 70 miles per hour.\n- He passes three cars that are going 80 miles per hour.\n- He gets pulled over by a police officer and receives a ticket.", "answer_keys": "You didn't provide any sentence. Could you please provide the sentence you wish to analyze?", "likes": "33% users", "solving_time": "2 minutes", "level": "3/10 Easy", "date": "06 November 2023"}
{"story": ["A man comes up to the border of a neighboring country on his motorcycle. The customs officer at the border crossing stops him and searches the man. He finds nothing so he lets him cross. The next day the same thing happens. This goes on every day for several months. "], "answer": ["Motorcycles."], "story_keys": "1. A man rides his motorcycle to the border of a neighboring country daily.\n2. He is stopped and searched by the customs officer at the border crossing every day. \n3. The officer never finds anything incriminating so he always lets the man cross.\n4. The man's daily border crossing continues for several months.", "answer_keys": "The key point is about motorcycles.", "likes": "33% users", "solving_time": "2 minutes", "level": "2/10 Easy", "date": "06 November 2023"}
{"story": ["A woman enters a large metal tube. She is overcome with fear and clenches her boyfriend’s hand tightly. She is visibly shaken. Her boyfriend gently rubs her arms and speaks softly to her, but is unaffected himself. A few hours later, the woman’s boyfriend tells her that it’s time to go and her torment ends. What was happening to the woman?"], "answer": ["The woman is terrified of flying but must travel to see a dying relative and this adds to her stress level. Her boyfriend does his best to comfort her during the few hours of the flight."], "story_keys": "1. A woman enters a large metal tube.\n2. She feels intense fear and holds her boyfriend's hand tightly.\n3. Her boyfriend consoles her by rubbing her arms and speaking softly, he is unaffected by the situation.\n4. After a few hours, the boyfriend tells her it's time to go, ending her torment.\n5. The text does not explicitly mention the situation causing the woman's fear.", "answer_keys": "- The woman is terrified of flying.\n- She needs to travel to see a dying relative.\n- This situation increases her stress level.\n- Her boyfriend tries to comfort her during the flight.", "likes": "25% users", "solving_time": "2 minutes", "level": "2/10 Easy", "date": "26 July 2023"}
