{"story": ["A woman buys a new pair of red high heels. Hours later, she dies."], "answer": ["Her husband was a magician that was doing a gun trick with an apple on her head and his eyes closed. He didn't realize that she was wearing high heals so he didn't calculate the height accurately.... so he killed her."], "story_keys": "1. A woman purchases a new pair of red high heels.\n2. The same woman dies hours after buying the heels.", "answer_keys": "1. The woman's husband was a magician.\n2. The magician was performing a gun trick with an apple placed on his wife's head.\n3. He performed the trick with his eyes closed.\n4. She was wearing high heels which he did not take into account.\n5. His inaccurate height calculation led to the woman's death.", "likes": "87% users", "solving_time": "14 minutes", "level": "7/10 Hard", "date": "17 March 2018"}
{"story": ["A little girl was warned by her parents never to open the cellar door. If she did, she would see things that they did not want her to see. One day, while her parents were out, they accidentally left the cellar door unlocked. The girl opened the cellar door. What did she see?"], "answer": ["When the girl opened the cellar door she saw the living room and a beautiful garden through its windows. She had never seen these before because her parents had kept her in the cellar all her life."], "story_keys": "- Little girl was warned by her parents not to open the cellar door.\n- They mentioned she would see things they didn't want her to see.\n- One day, her parents accidentally left the cellar door unlocked.\n- The girl opened the cellar door.\n- The text does not specify what the girl saw when she opened the door.", "answer_keys": "1. The girl opens the cellar door.\n2. She sees a living room and a beautiful garden through the windows.\n3. She has never seen these before.\n4. Her parents kept her in the cellar all her life.", "likes": "84% users", "solving_time": "14 minutes", "level": "7/10 Hard", "date": "10 February 2018"}
{"story": ["A woman dies from a long telephone conversation."], "answer": ["She was just coming from the mechanic, where she picked up her car. The mechanic forgot to put on the brakes, and he was trying to call and tell her. But it was impossible because she was already talking on the phone with someone."], "story_keys": "- A woman died as a result of a long telephone conversation.", "answer_keys": "- The woman picked up her car from the mechanic.\n- The mechanic forgot to put on the brakes of her car.\n- The mechanic tried to call her to inform about the brake issue.\n- He couldn't reach her as she was already on a phone call with someone else.", "likes": "83% users", "solving_time": "19 minutes", "level": "7/10 Hard", "date": "05 September 2022"}
{"story": ["A man who was expecting to die in a few days dies sooner than he thought."], "answer": ["The man was really sick and he decided to donate his organs to a rich man. Since this rich man's son wanted to inherit his farther's fortune he poisoned the donor so that his organs became unable to work again in his father's body."], "story_keys": "1. A man was expecting his death in a few days.\n2. The man dies sooner than he anticipated.", "answer_keys": "1. The man was seriously ill and decided to donate his organs to a wealthy individual.\n2. The rich man's son, motivated by greed for his father's wealth, poisoned the organ donor. \n3. As a result of the poisoning, the transplanted organs failed to function in the rich man's body.", "likes": "82% users", "solving_time": "23 minutes", "level": "8/10 Hard", "date": "04 March 2018"}
{"story": ["A man sitting on a park bench reads a newspaper article headlined \"Death at Sea\" and knows a murder has been committed."], "answer": ["The man is a travel agent. He had sold someone two tickets for an ocean voyage, one round-trip and one one-way. The last name of the man who bought the tickets is the same as the last name of the woman who \"fell\" overboard and drowned on the same voyage, which is the subject of the article he's reading. "], "story_keys": "- A man is sitting on a park bench reading a newspaper.\n- The newspaper article's headline is \"Death at Sea\".\n- He understands from the article that a murder has occurred.", "answer_keys": "1. The man is a travel agent.\n2. He sold two tickets for an ocean voyage to someone.\n3. One ticket was round-trip and the other was one-way.\n4. The last name of the tickets' buyer is the same as a woman who drowned on the same voyage.\n5. The woman reportedly \"fell\" overboard. \n6. The travel agent is currently reading an article about this incident.", "likes": "82% users", "solving_time": "23 minutes", "level": "8/10 Hard", "date": "18 January 2022"}
{"story": ["Before going to bed, the woman hides her shoe in the safe. What for?"], "answer": ["This woman works as a stewardess on an airplane. In the hotel before going to bed she puts her documents in the safe, and to not forget them in the morning, she puts one of her shoes along with the documents."], "story_keys": "- A woman hides her shoe in a safe before sleeping.", "answer_keys": "1. The woman works as a stewardess on an airplane.\n2. She puts her documents in the safe in her hotel room.\n3. She places one of her shoes with the documents to remember to collect them in the morning.", "likes": "80% users", "solving_time": "14 minutes", "level": "7/10 Hard", "date": "23 January 2018"}
{"story": ["Paul goes diving. How could he know he would be burnt to a crisp?"], "answer": ["He was scuba diving when a firefighting plane landed nearby and filled its tanks with water, sucking him in. He ran out of air while the plane was in flight; then the water, with him in it, was dumped onto a burning forest."], "story_keys": "- Paul goes diving.\n- Paul unexpectedly gets burnt to a crisp.", "answer_keys": "1. The person was scuba diving when a firefighting plane landed nearby.\n2. The plane filled its tanks with water, accidentally sucking the scuba diver.\n3. The diver ran out of air while the plane was in flight.\n4. The water, with the diver in it, was dumped onto a burning forest.", "likes": "79% users", "solving_time": "13 minutes", "level": "7/10 Hard", "date": "17 March 2018"}
{"story": ["A man is driving his car while listening to the radio when suddenly the radio goes silent. He then decides to leave the road and throw himself off the top of a cliff."], "answer": ["The man was a radio broadcaster who had commited a murder. He had left a recorded radio broadcast live as an alibi. Realizing that the program he had prepared had stopped airing accidentally and that they would know that he was the culprit, he decided to end his life."], "story_keys": "- A man is driving his car while listening to the radio.\n- The radio suddenly goes silent.\n- The man decides to leave the road.\n- He throws himself off the top of a cliff.", "answer_keys": "1. The man is a radio broadcaster.\n2. The man committed a murder.\n3. He left a recorded radio broadcast live to act as an alibi.\n4. The pre-recorded program he had prepared for his alibi stopped airing accidentally.\n5. The man realized that they would know he was the murderer once the program stopped airing.\n6. He decided to end his life as a result.", "likes": "79% users", "solving_time": "18 minutes", "level": "8/10 Hard", "date": "20 December 2021"}
{"story": ["One day a man received a parcel in the post. Carefully packed inside was a human arm. He examined it, repacked it and then sent it on to another man. The second man also carefully examined the arm before taking it to the woods and burying it. Why did they do this?"], "answer": ["The three men had been stranded on a desert island. Desperate for food, they had agreed to amputate their left arms in order to eat them. They swore an oath that each would have his left arm cut off. One of them was a doctor and he cut the arms off his two companions. They were then rescued. But his oath was still binding so he later had to have his arm amputated and sent to his colleagues. "], "story_keys": "1. A man received a parcel containing a human arm. \n2. He examined the arm and mailed it to another man.\n3. The second man examined the arm and then buried it in the woods.\n4. The reasons for these actions are not provided.", "answer_keys": "1. Three men got stranded on a desert island and were desperate for food.\n2. They agreed to amputate their left arms to eat them.\n3. They swore an oath that each would have his left arm cut off.\n4. One of them, who was a doctor, cut off the arms of his two companions.\n5. They were later rescued.\n6. Despite being rescued, the doctor was still bound by his oath, thus he also had his arm amputated and sent it to his colleagues.", "likes": "78% users", "solving_time": "28 minutes", "level": "9/10 Hard", "date": "05 August 2019"}
{"story": ["A man lets go of a bowling ball. A short while later, he is rushed to the hospital."], "answer": ["A physics professor is demonstrating conservation of energy by suspending a bowling ball from a piece of rope. He pulls the ball back until it's right in front of his nose, then lets go. It is supposed to swing away from him, then back at him, stopping just in front of his nose. Unfortunately, he gave the ball a slight push, resulting in the ball crashing into his nose upon its return."], "story_keys": "1. A man releases a bowling ball.\n2. Shortly after, he is urgently taken to the hospital.", "answer_keys": "1. A physics professor uses a suspended bowling ball to demonstrate conservation of energy.\n2. The ball is supposed to swing away and back towards the professor, stopping just in front of his nose.\n3. Accidentally, the professor pushes the ball slightly.\n4. This results in the ball swinging back and crashing into his nose.", "likes": "78% users", "solving_time": "32 minutes", "level": "7/10 Hard", "date": "18 January 2022"}
{"story": ["Bill was late for a birthday party and ended up in prison because of it. What happened?"], "answer": ["It was a priest’s birthday. When giving his toast, he said that the first person who confessed to him was a murderer. "], "story_keys": "- Bill was late for a birthday party.\n- Bill ended up in prison as a result of being late.", "answer_keys": "- It was a priest's birthday.\n- The priest revealed during his toast that the first person who confessed to him was a murderer.", "likes": "78% users", "solving_time": "31 minutes", "level": "8/10 Hard", "date": "17 April 2022"}
{"story": ["A man woke up, lit a match and saw something that frightened him to death."], "answer": ["This man was a prisoner. He wanted to escape and asked the mortician to do something for him. When somebody in prison would die, the prisoner would hide in the coffin and would be buried along with the corpse outside the territory of prison. And after some time he would be released by this mortician. "], "story_keys": "1. A man woke up.\n2. He lit a match.\n3. The man saw something that scared him extremely.", "answer_keys": "1. The man is a prisoner who wants to escape.\n2. He hatches a plan with the prison's mortician to accomplish this.\n3. The plan involves hiding in the coffin of a deceased prisoner.\n4. The coffin, with the man inside, would then be buried outside the prison's territory.\n5. After a certain period, the mortician would then exhume the coffin and release him.", "likes": "76% users", "solving_time": "26 minutes", "level": "8/10 Hard", "date": "10 February 2018"}
{"story": ["A man goes into a restaurant, orders albatross, eats one bite, and kills himself. Why? "], "answer": ["The man was in a ship that was wrecked on a desert island. When there was no food left, another passenger brought what he said was albatross but was really part of the man's wife (who had died in the wreck). The man suspects something fishy, so when they finally return to civilization, he orders albatross , realizes that what he ate before was his wife, and kills himself."], "story_keys": "- A man goes into a restaurant\n- He orders albatross\n- He eats one bite of the albatross\n- The man then kills himself.", "answer_keys": "1. A man was in a shipwreck and ended up on a desert island. \n2. When food ran out, another passenger served him meat, claiming it to be albatross. \n3. The meat was actually from the man's wife, who had died in the wreck.\n4. Suspecting something off, the man tests this once back in civilization by ordering albatross. \n5. Having realized the meat on the island was not albatross but his wife, the man kills himself.", "likes": "75% users", "solving_time": "28 minutes", "level": "9/10 Hard", "date": "05 January 2018"}
{"story": ["Students are taking an exam at military academy. One of them chooses a ticket and goes to his seat to get prepared. After some minutes he goes to the professor, silently gives him the student's record-book and leaves the classroom. The student got the excellent."], "answer": ["It was a morse code exam. During exam, the professor was tapping the message saying that any student may come up to him and get the excelllent."], "story_keys": "1. Students are taking an exam at a military academy.\n2. One student chooses a ticket and preparing at his seat.\n3. The student then goes to the professor and hands over his record-book.\n4. The student leaves the classroom.\n5. The student receives an \"excellent\" grade.", "answer_keys": "- The sentence is about a morse code exam.\n- The professor was sending a message via morse code during the exam.\n- The message indicated that any student could approach him and receive an excellent score.", "likes": "75% users", "solving_time": "16 minutes", "level": "7/10 Hard", "date": "04 March 2018"}
{"story": ["A man lies dead next to a feather. How did he die?"], "answer": ["The man was a sword swallower in a carnival side-show. While he was practicing, someone tickled his throat with the feather, causing him to gag."], "story_keys": "1. A man is dead.\n2. The man is lying next to a feather.\n3. It's unclear how the man died.", "answer_keys": "- The man was a sword swallower in a carnival side-show.\n- He was practicing his sword swallowing.\n- Someone tickled his throat with a feather.\n- The feather incident made him gag.", "likes": "75% users", "solving_time": "17 minutes", "level": "7/10 Hard", "date": "22 March 2021"}
{"story": ["At one time, the following warning notices appeared on one of the main squares of Prague, “Attention! Beware of pickpockets!” The local police knew that there really were a lot of pickpockets here, but they actively tore these notices down. Why?"], "answer": ["There were a lot of tourists on this square. It was pickpockets who pasted up notices about themselves. This made their task easier. People who read the notices automatically wanted to check whether their valuables were intact. The thieves were watching them and understood where their target was."], "story_keys": "- A warning notice about pickpockets appeared on one of Prague's main squares.\n- The local police knew that there were many pickpockets in the area.\n- Despite the known issue of pickpocketing, the police actively removed these warning notices. The reason for this is not explained.", "answer_keys": "- There were many tourists on a particular square.\n- Pickpockets posted notices about themselves in this square.\n- These notices induced people to check their valuables.\n- This action helped the thieves identify potential targets.", "likes": "75% users", "solving_time": "13 minutes", "level": "8/10 Hard", "date": "23 July 2022"}
{"story": ["Mike has been standing on his knee in the middle of the desert for over a day. He is all alone and has neither food nor water. But he doesn’t leave the place. What’s the matter?"], "answer": ["He thinks his foot is standing on a mine (although it is not). "], "story_keys": "-Mike has been standing on his knee in the desert for over a day\n-He is alone in the desert without food or water\n-Despite his situation, he does not leave his spot.", "answer_keys": "- The individual believes his foot is on a mine, even though it isn't.", "likes": "73% users", "solving_time": "21 minutes", "level": "7/10 Hard", "date": "20 January 2022"}
{"story": ["A man stole a wallet. This caused his death. What happened?"], "answer": ["Inside the wallet, there was a statement that this wallet’s owner opposes blood transfusion or organ transplantation for religious reasons. The thief got in an accident, and blood transfusion would have saved his life, but this wasn’t done because of the statement in the wallet."], "story_keys": "1. A man stole a wallet.\n2. This act resulted in his death.\n3. The details of how his theft led to his death are not provided.", "answer_keys": "1. The wallet contains a statement opposing blood transfusion or organ transplantation for religious reasons.\n2. The thief who stole the wallet was involved in an accident.\n3. A blood transfusion could have saved the thief's life.\n4. However, because of the statement in the stolen wallet, the transfusion was not performed.", "likes": "73% users", "solving_time": "24 minutes", "level": "8/10 Hard", "date": "05 February 2022"}
{"story": ["Silence fell, and after a few moments she died."], "answer": ["A blind ropedancer shows high-altitude acrobatic stunts at high altitude. According to the script, she was to jump off the rope exactly at that moment when the musician stops playing. "], "story_keys": "1. Silence fell.\n2. After a few moments, she died.", "answer_keys": "- A blind ropedancer performs high-altitude acrobatic stunts.\n- The script dictates that she was to jump off the rope when the music stops.", "likes": "73% users", "solving_time": "17 minutes", "level": "7/10 Hard", "date": "05 February 2022"}
{"story": ["A naked man is lying dead in the middle of a desert with a match in his hand. What happened?"], "answer": ["He was with several others in a hot air balloon crossing the desert. The balloon was punctured and they began to lose altitude. They tossed all their non-essentials overboard, then their clothing and food, but were still going to crash in the middle of the desert. Finally, they drew matches to see who would jump over the side and save the others; this man lost."], "story_keys": "- A naked man is dead in a desert.\n- He has a match in his hand. \n- The cause of the man's death is unknown.", "answer_keys": "1. A man was traveling in a hot air balloon across the desert with several others.\n2. The balloon was punctured and started losing altitude. \n3. They threw out all non-essential items, clothing, and food to prevent crashing. \n4. As they were still going to crash, they decided someone had to jump off the balloon.\n5. The man lost when they drew matches to decide who would jump.", "likes": "72% users", "solving_time": "23 minutes", "level": "7/10 Hard", "date": "04 March 2018"}
{"story": ["A man was walking down the street when he suddenly started to choke the woman walking by him. He was taken to the police station but soon after was released. "], "answer": ["This woman was his wife. Some years ago she staged her death and her husband was found guilty. He already got out of jail and now can not be convicted for the same crime one more time."], "story_keys": "1. A man started to choke a woman while walking down the street.\n2. The man was apprehended and taken to the police station.\n3. He was soon released from the police station.", "answer_keys": "1. The woman in context faked her own death several years ago.\n2. Her husband was mistakenly convicted for her staged death.\n3. The husband has since been released from jail.\n4. He cannot be convicted again for the same crime.", "likes": "71% users", "solving_time": "18 minutes", "level": "8/10 Hard", "date": "04 March 2018"}
{"story": ["A man is returning from Switzerland by train. If he had been in a non-smoking car he would have died."], "answer": ["The man used to be blind — he's returning from an eye operation which restored his sight. He spent all his money on the operation, so when the train (which had no internal lighting) goes through a tunnel, he thinks he's gone blind again and decides to kill himself. But before he could do it, he saw the light of the cigarettes people were smoking and realized he could still see."], "story_keys": "1. A man is returning from Switzerland via train.\n2. If he had been in a non-smoking car, he would have died.", "answer_keys": "1. The man was originally blind. \n2. He underwent an eye operation to restore his sight.\n3. He spent all his money on the operation.\n4. During a train ride in a dark tunnel, he mistakenly thought he's blind again.\n5. This led him to contemplate suicide.\n6. He then saw the light from people's cigarettes which helped him realize he could still see.", "likes": "70% users", "solving_time": "43 minutes", "level": "7/10 Hard", "date": "12 February 2022"}
{"story": ["A guy goes into a drugstore and leaves shortly after with the money from the cash register. The drugstore owner calls the Police Station and, some time later, a police officer recovers the money and takes the guy away. That evening the three people go to the police station to report a theft."], "answer": ["The guy was the drugstore owner's son. His car had been stolen and he had an important exam. He had been to the drugstore to ask his mother for some money so he could take a taxi. In addition to this, the mother called her husband - who was a police officer - and asked him to bring their son to the exam. He did, and since the son did not need the money any more, he gave it back to his father, who returned it to the mother. At the end of the day, the whole family reported the car theft."], "story_keys": "1. A man enters a drugstore and leaves with cash from the register.\n2. The drugstore owner reports the theft to the police.\n3. A police officer later recovers the stolen money and apprehends the thief.\n4. That same evening, the three individuals (the guy, the drugstore owner, and the police officer) go to the police station to report the theft.", "answer_keys": "1. The drugstore owner's son's car had been stolen.\n2. The son had an important exam on the same day.\n3. He asked his mother, the drugstore owner, for money to take a taxi.\n4. The mother called her husband, a police officer, to bring their son to the exam.\n5. The son returned the unused money to his father, who gave it back to his mother.\n6. The family reported the car theft at the end of the day.", "likes": "67% users", "solving_time": "32 minutes", "level": "8/10 Hard", "date": "04 January 2018"}
{"story": ["At the end of the XIX century one american enterpreneur invented a system to withstand competition. This system we all use nowadays. "], "answer": ["This american enterpreneur was Almon Brown Strowger. Strowger patented his automatic telephone exchange and left the undertaking business to mass-produce his new invention."], "story_keys": "- At the end of the XIX century, an American entrepreneur invented a system to withstand competition.\n- This system is widely used nowadays.", "answer_keys": "- The American entrepreneur is Almon Brown Strowger.\n- Strowger patented his automatic telephone exchange.\n- He left the undertaking business to mass-produce his new invention.", "likes": "66% users", "solving_time": "62 minutes", "level": "7/10 Hard", "date": "10 February 2018"}
{"story": ["After a professor died, his will was followed carefully, but later it turned out that he wanted something completely different. Why?"], "answer": ["The professor signed his skeleton away to the medical university. After his death, his skeleton was turned into a teaching aid. But later a skeleton on a stand was found in the professor’s office – this very skeleton the professor had in mind."], "story_keys": "1. A professor passed away.\n2. His will was initially followed carefully.\n3. It was later discovered that the professor actually wanted something different than what was stated in the will. \n4. The reason for this discrepancy is questioned.", "answer_keys": "1. The professor pledged his skeleton to the medical university.\n2. After his death, the professor's skeleton was transformed into a teaching aid.\n3. A skeleton on a stand was later discovered in the professor's office.\n4. The skeleton found in the office is thought to be the same one the professor had pledged to the university.", "likes": "66% users", "solving_time": "13 minutes", "level": "7/10 Hard", "date": "01 November 2020"}
{"story": ["Two women are talking. One goes into the bathroom, comes out five minutes later, and kills the other."], "answer": ["Both women are white; the one whose house this takes place in is single. A black friend of the other woman, the one who goes into the bathroom, was recently killed, reportedly by the KKK (Ku Klux Klan). The woman who goes into the bathroom discovers a bloodstained KKK robe in the other's laundry hamper, picks up a nail file from the medicine cabinet, and goes out and kills the other."], "story_keys": "1. Two women are having a conversation.\n2. One woman leaves to go into the bathroom.\n3. The same woman comes out from the bathroom after five minutes.\n4. The woman who came out from the bathroom kills the other woman.", "answer_keys": "1. Two white women are involved in the story.\n2. The incident takes place in the house of one of the women who is single.\n3. The second woman's black friend was reportedly killed by the KKK.\n4. The second woman discovers a bloodstained KKK robe in the first woman's laundry hamper.\n5. She picks up a nail file from the medicine cabinet and kills the first woman.", "likes": "66% users", "solving_time": "30 minutes", "level": "9/10 Hard", "date": "18 January 2022"}
{"story": ["A man had lunch at the restaurant, and the waiter brought him his bill. He wrote out a check for the required amount but suddenly turned it over and wrote a few words on the reverse side of the check as congratulations to the restaurant owner. What for?"], "answer": ["Salvador Dali was famous not only by his eccentric escapades, but also for his passion for money. Despite earning millions from his paintings and numerous commercial projects, the famous surrealist wasn’t above saving on restaurant bills. The whole evening, Dali could treat a large company of friends to any dishes and drinks from the menu. When it was time to pay the bill, the artist generously signed a check for a huge amount, then turned the check over and wrote a few warm words, expressing gratitude to the restaurant owner. "], "story_keys": "- A man went to a restaurant for lunch.\n- Upon receipt of the bill, the man wrote a check to cover the payment.\n- He then wrote a message of congratulations for the restaurant owner on the back of the check. \n- The text questions why the man wrote this message.", "answer_keys": "- Salvador Dali was known for his eccentric behavior and love of money.\n- He earned millions from his paintings and commercial projects.\n- Despite his wealth, he was not one to spend lavishly on restaurant bills.\n- When dining with friends, he would usually pay by writing a large check.\n- Dali would then write a message of thanks on the back of the check, essentially turning it into a piece of his artwork that the restaurant owner is unlikely to cash due to its potential value.", "likes": "66% users", "solving_time": "85 minutes", "level": "9/10 Hard", "date": "20 April 2022"}
{"story": ["King George IV was born in 1763 and ruled England from 1820 to 1830 when he died. He wasn’t an outstanding ruler but is known as a footwear trendsetter. His shoes were fundamentally different from those worn by his contemporaries. Everyone liked this innovation so much that today it’s a common practice, which can’t be said about those times. What kind of innovation is it?"], "answer": ["This king was the first to have a right and a left boot. Before then, all shoes and boots were made to fit both feet."], "story_keys": "- King George IV was born in 1763 and was the ruler of England from 1820 to 1830.\n- He was not particularly known for his ruling but more so as a trendsetter in footwear.\n- The shoes he popularized were very different from those worn by his contemporaries.\n- The innovation introduced by King George IV in footwear became so well liked that nowadays it's common practice, unlike during his times.", "answer_keys": "- The king was the first to have distinct right and left boots.\n- Prior to this, all shoes and boots were made to fit either foot.", "likes": "66% users", "solving_time": "11 minutes", "level": "7/10 Hard", "date": "22 December 2023"}
{"story": ["Oscar was sitting reading his newspaper, when he heard a noise. When he realized what had happened, he bitterly regretted not having caught the taxi in time. Shortly afterwards, he committed suicide. "], "answer": ["Oscar was broke. He was a miniature car models collector and, to solve his economic problems, he was going to sell his most valuable car. He had been cleaning it and did not put it down on the table properly when he finished. When he sat down and began to read his newspaper, he heard how it fell off the table. He could not catch it in time before it crashed into the floor."], "story_keys": "1. Oscar was sitting and reading his newspaper.\n2. He heard a noise and realized an incident occurred.\n3. He regretted not taking a taxi in time.\n4. He committed suicide shortly after the regret.", "answer_keys": "- Oscar was broke and a collector of miniature car models.\n- To solve his financial problems, Oscar decided to sell his most valuable car model.\n- Oscar was cleaning the model and didn't secure it properly on the table.\n- The model car fell off the table and crashed onto the floor. Oscar was unable to catch it in time.", "likes": "61% users", "solving_time": "27 minutes", "level": "8/10 Hard", "date": "04 January 2018"}
{"story": ["A woman completes a drawing, and then commits suicide. Why?"], "answer": ["Long suspicious of her family history, the woman does the research necessary to draw her family tree. Upon completing it, she confirms that she is the product of incest, a fact she cannot live with."], "story_keys": "1. A woman finishes a drawing.\n2. The woman then commits suicide.\n3. Reason for her suicide is questioned.", "answer_keys": "1. A woman, long suspicious of her family history, researches to draw her family tree.\n2. Upon completing the family tree, she confirms her suspicion.\n3. It's revealed that she is the product of incest.\n4. The woman can't live with the newly discovered fact about her origin.", "likes": "61% users", "solving_time": "21 minutes", "level": "7/10 Hard", "date": "08 May 2023"}
{"story": ["Why did a healthy young girl put a gypsum on her arm, which was not damaged?"], "answer": ["A young girl put a gypsum on the healthy arm before an oral french exam. She thought that the examiner would ask about her arm. And she came to the exam, having prepared for this particular question."], "story_keys": "- A healthy young girl put a gypsum on her arm.\n- The girl's arm was not damaged. \n- The reason why she did this is being questioned.", "answer_keys": "- A young girl intentionally put a gypsum on her healthy arm before her oral French exam.\n- She assumed that the examiner would ask her about her arm.\n- She prepared for the exam specifically considering this potential question about her arm.", "likes": "60% users", "solving_time": "27 minutes", "level": "8/10 Hard", "date": "27 January 2018"}
{"story": ["Two men are beating each other up and both of them suddenly fall to the floor."], "answer": ["The daughter of one of the boxers had been kidnapped and she would be killed if her father won the fight. At the end of the fight, the boxer's opponent fainted and the other boxer - in order not to win the match - threw himself to the floor."], "story_keys": "- Two men are physically fighting each other.\n- Both of these men suddenly fall to the floor.", "answer_keys": "1. The daughter of one boxer was kidnapped with a threat, she would be killed if her father won the fight.\n2. In the final round, the opponent boxer fainted.\n3. To avoid winning the match (and thus save his daughter), the boxer deliberately threw himself to the floor.", "likes": "59% users", "solving_time": "25 minutes", "level": "7/10 Hard", "date": "04 January 2018"}
{"story": ["A man goes to the doctor to get the results of some previous tests. The results do not show up any health issues. However, he commits suicide shortly after the visit."], "answer": ["The patient knew that his wife was cheating on him, but he only knew the lover's name. His wife swore to him that this lover did not exist. However when the man left the doctor's, he saw the lover's name on the report. He realized his wife was cheating on him with the doctor and could not cope with it. "], "story_keys": "- A man visits the doctor to check the results of some tests.\n- The test results showed no health issues.\n- Despite the positive health report, the man commits suicide shortly after the visit.", "answer_keys": "1. The patient was aware his wife was unfaithful.\n2. He knew the name of his wife's lover but nothing more.\n3. His wife denied that the lover existed. \n4. Upon leaving the doctor's, the patient saw the lover's name on his report. \n5. The patient concluded that his wife was having an affair with the doctor.\n6. He was unable to cope with this realization.", "likes": "54% users", "solving_time": "16 minutes", "level": "7/10 Hard", "date": "04 January 2018"}
{"story": ["When kids were watching TV, they were not frigthened so much. But when they saw others suffering, they realized that something was not right. "], "answer": ["It was an experiment when kids were giving blood. It showed that the kids were feeling better during this process if they were watching TV rather than if they were supported by their parents. "], "story_keys": "- Kids were not frightened while watching TV.\n- Kids realized something was not right when they saw others suffering.", "answer_keys": "- The sentence discusses an experiment involving kids giving blood.\n- The experiment found that kids felt better while watching TV during the blood drawing process.\n- Kids watching TV during the procedure seemed to feel better than those supported by their parents.", "likes": "50% users", "solving_time": "13 minutes", "level": "7/10 Hard", "date": "27 January 2018"}
{"story": ["There were many reasons why John enjoyed coming here. But his wife Mary hated this place, as did other women in the city. Why?"], "answer": ["This situation puzzle is about a real geographical object. In Stockholm, there’s a narrow – no more than a meter wide – street that leads to a drinking place. It was very popular in the 18th century, as drunkards could hold on to the walls when walking along the street. However, their wives couldn’t enter this street, because their hooped dresses got stuck between the walls."], "story_keys": "1. John enjoys coming to a specific place.\n2. His wife, Mary, and other women in the city hate this place.\n3. The reasons for their dislike are questioned.", "answer_keys": "- The situation puzzle discusses a real geographical object in Stockholm.\n- There's a narrow street, no more than a meter wide, that leads to a drinking place.\n- The street was popular in the 18th century for drunkards who could hold on to the walls when walking along the street.\n- Wives couldn't enter this street as their hooped dresses got stuck between the walls.", "likes": "50% users", "solving_time": "5 minutes", "level": "8/10 Hard", "date": "16 April 2018"}
{"story": ["Many people were surprised when a famous town merchant named Bill rolled out a barrel of honey to the square and offered everyone a treat."], "answer": ["Bill has been selling honey for many years. He scooped the product up with a measuring cup and poured it into a buyer’s jug."], "story_keys": "- A famous town merchant named Bill presented a barrel of honey to the square.\n- This unexpected event surprised many people.\n- The honey was offered to everyone as a treat.", "answer_keys": "['Bill has been in the business of selling honey for many years', 'He uses a measuring cup to scoop the honey', 'He then pours the scooped honey into a buyer’s jug.']", "likes": "50% users", "solving_time": "5 minutes", "level": "8/10 Hard", "date": "14 September 2020"}
{"story": ["The killer was severely punished by his victim. Plus, instantly. How?"], "answer": ["The man wanted to knock a snowman down with his car and gathered fairish speed. But it turned out that in the middle of the snowman there was an iron pole sticking out of the ground."], "story_keys": "1. The killer was punished by his victim.\n2. The punishment was severe and happened instantly.\n3. The method of punishment is questioned.", "answer_keys": "1. A man sought to knock down a snowman using his car.\n2. He gathered a decent amount of speed for the act.\n3. Upon impact, it was discovered that an iron pole was stuck in the middle of the snowman, anchored to the ground.", "likes": "50% users", "solving_time": "4 minutes", "level": "7/10 Hard", "date": "16 April 2022"}
{"story": ["They had to throw away plenty of their valuables, but it didn’t made them upset. What happened?"], "answer": ["They smuggled alcohol at the Prohibition time in the United States. They were ready for unexpected customs control. They tied bags of salt to each box in advance. In case of danger, they threw them into the water. After a while, salt dissolved in the water and the cargo floated back to the surface."], "story_keys": "1. The individuals discarded many of their valuable possessions.\n2. Despite this, they did not get upset.\n3. The sentence leaves an unanswered question about what specific event occurred.", "answer_keys": "- Alcohol was smuggled during Prohibition time in the United States.\n- Smugglers were prepared for unexpected customs control.\n- Bags of salt were tied to each box in preparation.\n- If there was danger, they would throw the cargo into the water.\n- The salt would dissolve causing the cargo to float back to the surface.", "likes": "50% users", "solving_time": "5 minutes", "level": "7/10 Hard", "date": "19 November 2022"}
{"story": ["The man was afraid to go home because the man in the mask was there."], "answer": ["They are playing baseball. The man in the mask is the catcher. The other man is afraid to advance to home base."], "story_keys": "- The man feels fear about going home.\n- There is a masked man at his home causing this fear.", "answer_keys": "1. People are playing baseball.\n2. The man wearing a mask is the catcher.\n3. Another man is afraid to advance to home base.", "likes": "40% users", "solving_time": "10 minutes", "level": "8/10 Hard", "date": "05 November 2023"}
{"story": ["A prisoner was put in an escape-proof cell and told that he would be pardoned if he could break out. He was also given permission to keep any plants he wished in his cell. He was released in less than a week. How did he di it?"], "answer": ["He requested a poison ivy plant. Soon after receiving it, he broke out — in a rash. Of course, he then received his pardon."], "story_keys": "1. A prisoner was placed in an escape-proof cell.\n2. He was told he would be pardoned if he could break out.\n3. He was allowed to keep any plants in his cell. \n4. Less than a week later, the prisoner was released. \n5. It's a mystery how the prisoner managed to escape.", "answer_keys": "1. A man requested a poison ivy plant.\n2. He developed a rash after receiving the plant. \n3. He received a pardon thereafter.", "likes": "33% users", "solving_time": "20 minutes", "level": "7/10 Hard", "date": "06 November 2023"}
{"story": ["A woman in France in 1959 is waiting in her room, with all the doors locked from the inside, for her husband to come home. When he arrives, the house has burned to the ground and she's dead. How come?"], "answer": ["The hot sun reflected from the woman's large mirror (which may have been imperfectly flat and therefore focused the sunlight) and heated the lingerie she was wearing to the burning point. She was absorbed in a book at the time and didn't notice the heat until her clothing was afire. Nobody could get to her to help because her doors were locked from the inside."], "story_keys": "1. The event takes place in France in 1959. \n2. A woman is waiting in her room with all doors locked from inside for her husband.\n3. When her husband arrives home, he finds the house burned down.\n4. The woman is found dead.", "answer_keys": "1. A woman's large, possibly imperfectly flat mirror reflected the hot sun.\n2. The reflected sunlight heated the lingerie the woman was wearing to a burning point.\n3. The woman didn't notice the heat as she was reading a book.\n4. Her clothing set on fire before she noticed the heat. \n5. No one could reach her to help because her doors were locked from the inside.", "likes": "30% users", "solving_time": "10 minutes", "level": "7/10 Hard", "date": "19 January 2022"}
