{"story": ["A man is found dead in a filed. Lying next to him is an unopened package."], "answer": ["The man was skydiving and his parachute did not open. The unopened package was his parachute."], "story_keys": "- A man has been found dead in a field.\n- An unopened package is lying next to the dead man.", "answer_keys": "1. The man was skydiving.\n2. His parachute did not open.\n3. The unopened package mentioned was his parachute.", "likes": "91% users", "solving_time": "9 minutes", "level": "4/10 medium", "date": "03 March 2018"}
{"story": ["Helen never thought that her decision to travel by plane would save her life."], "answer": ["A few days earlier Helen had been operated on. Before boarding the plane, she had to go through the metal detector, which kept going off, despite the fact that she had removed everything metal she had on. After an X-ray examination, it was discovered that the doctors had left a scalpel inside her body. If Helen had not discovered it in time, she would died for sure."], "story_keys": "- Helen's decision to travel by plane ended up saving her life, which she didn't expect.", "answer_keys": "- Helen had undergone surgery a few days earlier.\n- She had trouble going through the metal detector at an airport because it kept going off.\n- An X-ray examination revealed that physicians left a scalpel inside her body after surgery.\n- If not discovered in time, the leftover scalpel could have caused her death.", "likes": "87% users", "solving_time": "13 minutes", "level": "6/10 medium", "date": "17 March 2018"}
{"story": ["Jack and Judy were lying on the floor dead. There was a puddle of water and broken glass on the floor. How did they die?"], "answer": ["Jack and Judy were two goldfish that swam in a small aquarium placed on a shelf. One afternoon, a cat sneaked into the room through the window and hit the aquarium that fell off the shelf and broke against the ground."], "story_keys": "- Jack and Judy are dead.\n- They were lying on the floor.\n- There is a puddle of water and broken glass on the floor.\n- The cause of their death is questioned.", "answer_keys": "['Jack and Judy are two goldfish in a small aquarium', 'The aquarium is placed on a shelf', 'A cat sneaked into the room through the window', 'The cat hit the aquarium causing it to fall and break against the ground.']", "likes": "87% users", "solving_time": "10 minutes", "level": "5/10 medium", "date": "17 March 2018"}
{"story": ["There are a man and his son in a car. The car crashes and the father dies. When the ambulance takes the son to the hospital, the surgeon says:\" I can't do the surgery, because he is my son\". How can that be possible?"], "answer": ["Because the surgeon is a woman and his mother."], "story_keys": "- A man and his son are in a car.\n- The car crashes resulting in the father's death.\n- The son is transported to the hospital.\n- The surgeon refuses to perform the surgery claiming the patient is their son.", "answer_keys": "The sentence is not clear, so extracting a key point is difficult. However, potentially significant elements may include a surgeon being a woman and a reference to 'his mother'.", "likes": "87% users", "solving_time": "2 minutes", "level": "5/10 medium", "date": "16 November 2023"}
{"story": ["A hunter aimed his gun carefully and fired. Seconds later, he realized his mistake. Minutes later, he was dead."], "answer": ["He hunted in snow-capped mountains. The shot provoked an avalanche, which covered the man. He died of strangulation."], "story_keys": "1. A hunter aimed his gun and fired.\n2. He shortly realized his mistake.\n3. Within minutes, the hunter was dead.", "answer_keys": "1. A man was hunting in snow-capped mountains.\n2. His shot provoked an avalanche.\n3. The avalanche covered the man.\n4. The man died of strangulation.", "likes": "86% users", "solving_time": "9 minutes", "level": "5/10 medium", "date": "18 January 2018"}
{"story": ["A man went into a party and drank some of the punch. He then left early. Everyone at the party who drunk the punch subsequently died of poisoning. Why did the man not die?"], "answer": ["The poison from the punch came from the ice cubes. When the man drank the punch, the ice was fully frozen. Gradually, as the ice cubes melted the poison was released into the punch."], "story_keys": "- A man attended a party and drank punch.\n- The man left the party early.\n- Everyone at the party who drank the punch died of poisoning.\n- The man did not die despite having consumed the punch.", "answer_keys": "1. The poison in the punch came from the ice cubes.\n2. The ice was fully frozen when the man drank the punch.\n3. The poison was released into the punch as the ice cubes melted.", "likes": "86% users", "solving_time": "9 minutes", "level": "4/10 medium", "date": "10 February 2018"}
{"story": ["A man lives on the 10th floor of a building. Every morning he takes the elevator to the ground floor to go to work. Upon returning from work he goes up always to floor 7th in the elevator. Then he goes upstairs the 3 remaining floors. "], "answer": ["The man is very short so he has no problem to press the button on the ground floor but he does not reach the 10th floor button. The maximum he reaches is up to the 7th floor button."], "story_keys": "- A man lives on the 10th floor of a building.\n- He takes the elevator to the ground floor every morning to go to work.\n- He returns from work and uses the elevator to go to the 7th floor.\n- He then walks up the remaining 3 floors to his apartment.", "answer_keys": "- The man is very short.\n- He can easily press the button on the ground floor.\n- He cannot reach the 10th floor button due to his height.\n- The highest floor button he can reach is the 7th floor.", "likes": "86% users", "solving_time": "9 minutes", "level": "4/10 medium", "date": "04 March 2018"}
{"story": ["Every night before going to sleep, Lisa locks the door of her house and attaches the key to a string. Why?"], "answer": ["Lisa was a sleepwalker. Some days before, she had left her house in the middle of the night without realizing. To prevent this happening again, she began tying the key with a piece of string to a bell each night. That way, if Lisa tried to leave the house, her husband would wake up and take her back to bed."], "story_keys": "- Every night, Lisa locks the house door before going to sleep.\n- Lisa attaches the key to a string after locking the door. \n- The text poses a question about why Lisa does this routine.", "answer_keys": "- Lisa was a sleepwalker who had previously left her house in the middle of the night without realizing. \n- To prevent future incidents, she started tying her house key to a bell using a string every night.\n- If Lisa tried to leave the house, the bell would wake up her husband who could then take her back to bed.", "likes": "86% users", "solving_time": "14 minutes", "level": "5/10 medium", "date": "30 July 2021"}
{"story": ["After George tries to hug a person, he dies by drowning."], "answer": ["George was under the influence of alcohol and saw his reflection on a river. As he was intoxicated, he thought that it would be a good idea to give a hug to the \"stranger\". However this caused him to fall into the river and drown. "], "story_keys": "- George attempts to hug someone.\n- George drowns and dies.", "answer_keys": "- George was under the influence of alcohol.\n- He saw his reflection on a river and due to intoxication, mistook it as a stranger.\n- Believing it was a good idea to hug this \"stranger\", he attempted to do so.\n- This action caused him to fall into the river.\n- He drowned as a result of falling into the river.", "likes": "85% users", "solving_time": "11 minutes", "level": "5/10 medium", "date": "17 March 2018"}
{"story": ["A married couple was speeding into town when their sedan ran out of gas. The man went for help after making sure his wife closed the windows and locked the doors of the car. Upon his return, he found his wife dead and a stranger in the car. The windows were still closed, the doors were still locked, and no damage was done to the car. "], "answer": ["The woman gave birth, and bled to death. Since the father has never seen the baby before, the kid can technically be called a stranger."], "story_keys": "1. A married couple ran out of gas while speeding into town. \n2. The man left to get help, instructing his wife to lock the car. \n3. When the man returned, he found his wife dead inside the locked car with a stranger. \n4. No damage was observed on the car, and the doors and windows were still locked.", "answer_keys": "1. The woman died after giving birth.\n2. The father of the baby has never seen the baby before.\n3. The baby can technically be considered a stranger to the father.", "likes": "84% users", "solving_time": "7 minutes", "level": "5/10 medium", "date": "10 February 2018"}
{"story": ["A man woke up at night feeling thirsty. Then he turned off the light everywhere and went to bed again. In the morning he woke up, looked out of the window and yelled. Soon after he committed suicide. "], "answer": ["The man was caretaker. Accindetally he turned off the lighthouse and it caused some shipwrecks. When he woke up, he realized what he have done."], "story_keys": "1. A man woke up at night feeling thirsty.\n2. He turned off the light and went back to bed.\n3. Upon waking in the morning, he looked out of the window and yelled.\n4. Shortly after, the man committed suicide.", "answer_keys": "1. The man was a caretaker.\n2. He accidentally turned off the lighthouse.\n3. This action caused some shipwrecks.\n4. Upon waking up, he realized his mistake.", "likes": "84% users", "solving_time": "13 minutes", "level": "5/10 medium", "date": "04 March 2018"}
{"story": ["Anthony couldn't have imagine his cold would be the cause of his death."], "answer": ["There was a gas leak at Anthony's house but since he had a cold, he could not smell it. He died when he started a fire, as he was cooking his dinner. "], "story_keys": "- Anthony dies due to a cold, which he did not expect to be fatal.", "answer_keys": "1. There was a gas leak at Anthony's house.\n2. Anthony had a cold which prevented him from smelling the gas leak. \n3. Anthony started a fire to cook his dinner. \n4. The combination of the gas leak and the fire led to Anthony's death.", "likes": "84% users", "solving_time": "6 minutes", "level": "5/10 medium", "date": "03 March 2018"}
{"story": ["Francis dies of a heart attack at work. His colleagues are there when it happens. However, they do not call for help until Francis dies. "], "answer": ["Francis was a theather actor and suffered a heart attack in the middle of a performance. However, he was playing someone who was having a heart attack. Therefore, both his colleagues and the audience simply thought that he was giving a really impressive performance."], "story_keys": "- Francis dies of a heart attack at work. \n- His colleagues are present during his heart attack.\n- Despite being present, his colleagues do not call for help until after Francis dies.", "answer_keys": "- Francis was a theater actor.\n- He suffered a heart attack during a performance.\n- His character was supposed to have a heart attack in the play.\n- His colleagues and audience thought it was part of the performance.", "likes": "84% users", "solving_time": "7 minutes", "level": "4/10 medium", "date": "03 March 2018"}
{"story": ["When on a bus, Kate wanted to offer her seat to a woman who's just goton. But she was very embarrassed and refused. Why?"], "answer": ["Little Kate was sitting in her dad's lap."], "story_keys": "Kate wanted to offer her seat on a bus to a woman who just got on, but the woman refused, leaving Kate embarrassed.", "answer_keys": "- Little Kate is sitting in her dad's lap.", "likes": "84% users", "solving_time": "9 minutes", "level": "5/10 medium", "date": "28 June 2020"}
{"story": ["Beulah died in the Appalachians, while Craig died at sea. Everyone was much happier with Craig's death. How come?"], "answer": ["Beulah and Craig were hurricanes."], "story_keys": "1. Beulah died in the Appalachians.\n2. Craig died at sea.\n3. Everyone was much happier with Craig's death.", "answer_keys": "- Beulah and Craig were hurricanes.", "likes": "84% users", "solving_time": "8 minutes", "level": "6/10 medium", "date": "19 January 2022"}
{"story": ["A woman is at home, sad, and watching the street through her window. Soon after she jumps out of it. Just in that precise moment, she hears the telephone ringing and regrets jumping."], "answer": ["After a nuclear catastrophe, the woman thought that she was the only person alive and decided to put an end to her life. When the telephone rang she realized that she was not alone. But it was too late for her. "], "story_keys": "1. The woman is at home, feeling sad and watching the street through her window.\n2. She decides to jump out of the window.\n3. Just as she jumps, she hears the telephone ring.\n4. After jumping, she feels regret.", "answer_keys": "1. A nuclear catastrophe occurred.\n2. A woman believed she was the only survivor.\n3. The woman decided to end her own life because of her perceived loneliness.\n4. The telephone rang, indicating the presence of another survivor.\n5. The recognition that she was not alone came too late for the woman.", "likes": "83% users", "solving_time": "18 minutes", "level": "6/10 medium", "date": "04 January 2018"}
{"story": ["A man walks into a bar and asks for a drink. The bartender pulls out a gun and points it at him. The man says, \"Thank you,\" and walks out. How come?"], "answer": ["The man has hiccups; the bartender scares them away by pulling a gun."], "story_keys": "-A man walks into a bar and asks for a drink.\n-The bartender points a gun at him instead.\n-The man says \"Thank you\" and leaves.", "answer_keys": "1. The man has hiccups.\n2. The bartender scares away the man's hiccups.\n3. The bartender scares the hiccups away by pulling a gun.", "likes": "83% users", "solving_time": "11 minutes", "level": "5/10 medium", "date": "18 January 2018"}
{"story": ["A salesman tries too hard to get a sale and as a result ends up dying. "], "answer": ["The salesman sold bulletproof vests. One day, to prove the quality of his product to a customer, he put one of them on and insisted the client to shoot him. The client accepted but unfortunately he missed the shot and shot the salesman in the head. "], "story_keys": "- A salesman excessively tries to achieve a sale.\n- The salesman ends up dying as a result of his efforts.", "answer_keys": "- The salesman sells bulletproof vests.\n- To demonstrate his product quality, the salesman put a vest on and asked a customer to shoot him.\n- The client agreed but missed the shot.\n- The saleman got shot in the head.", "likes": "83% users", "solving_time": "9 minutes", "level": "4/10 medium", "date": "03 March 2018"}
{"story": ["A young woman has her photo taken with her grandfather, but they have never met before, and neither of them is aware of their relationship."], "answer": ["The woman is a student in medical school. She has her photo taken with a human skeleton in the classroom, used for instruction. She does not know that the skeleton is that of her grandfather, who donated his body to science."], "story_keys": "1. A young woman has her photo taken with her grandfather.\n2. They have never met before.\n3. Neither of them is aware of their relationship.", "answer_keys": "1. The woman is a medical student.\n2. She takes a photo with a human skeleton, used for teaching, in the classroom.\n3. The woman doesn't know that the skeleton is actually her grandfather's remains.\n4. Her grandfather had donated his body to science.", "likes": "83% users", "solving_time": "16 minutes", "level": "6/10 medium", "date": "08 May 2023"}
{"story": ["A cowboy rode into town on Friday, spent one night in town, and left on Friday. How do you account for this?"], "answer": ["His horse is named Friday."], "story_keys": "- A cowboy arrives in town on Friday.\n- The cowboy spends one night in town.\n- The cowboy departs from the town on Friday.\n- An explanation is asked for this scenario.", "answer_keys": "['His horse', 'named Friday']", "likes": "83% users", "solving_time": "4 minutes", "level": "4/10 medium", "date": "06 November 2023"}
{"story": ["A car driver causes an accident when he crashes into a bike, as he was making an unexpected turn at a crossroad. When the policemen arrive, another man gets arrested. The one who was driving is carried home. "], "answer": ["The driver was receiving driving lessons and his instructor told him to make an incorrect turn at a crossroad, crashing into a bike. The policemen considered the driving instructor to be responsible for the accident so they arrested him and took the learner home. "], "story_keys": "1. A car driver caused an accident by crashing into a bike at a crossroad.\n2. The accident happened due to the car driver making an unexpected turn.\n3. After the accident, police arrived on the scene.\n4. Instead of the driver, another man was arrested at the scene.\n5. The driver of the car was taken home.", "answer_keys": "1. The driver was receiving driving lessons.\n2. The instructor told him to make an incorrect turn at a crossroad, causing a crash into a bike. \n3. The police held the driving instructor responsible for the accident. \n4. The instructor was arrested.\n5. The learner driver was taken home by the police.", "likes": "82% users", "solving_time": "10 minutes", "level": "5/10 medium", "date": "04 January 2018"}
{"story": ["The son of a rich man was kidnapped. The kidnapper wanted the rich man to bring and put the expensive diamond into the call-box located in a city park. Policemen surrounded this park, intending to catch the criminal. The father of the kidnapped child came to the call-box and did everything the kidnapper said to him, but the police could not prevent the cunning criminal from taking the diamond out of the call-box. They didn't grab the villian as well. What did he do?"], "answer": ["This is a real history that happened in Taiwan. When the father came to the call-box, he found a postal pigeon in the cage. There was a note attached to him, in which it was said that the diamond should be put into a small pouch attached to the neck of the pigeon, and then he should let the pigeon out of the cage. When the rich man did this, the dove flew through the city to its dovecote, and the police could not follow it."], "story_keys": "- The son of a rich man was kidnapped.\n- The kidnapper demanded the rich man put an expensive diamond in a call-box in a city park.\n- Policemen surrounded the park in attempts to apprehend the kidnapper.\n- Despite following the kidnapper's instructions, the police failed to prevent the criminal from taking the diamond or apprehend him.", "answer_keys": "- The narrative is based on a real incident in Taiwan involving a postal pigeon and a diamond.\n- A father found a postal pigeon in a cage at a call-box, with a note attached to it. \n- The note instructed him to place a diamond in a pouch attached to the pigeon's neck and release it.\n- The man, who was wealthy, complied and the pigeon flew through the city to its dovecote, eluding police pursuit.", "likes": "82% users", "solving_time": "8 minutes", "level": "5/10 medium", "date": "10 February 2018"}
{"story": ["A man is lying awake in bed. He makes a phone call, says nothing, and goes to sleep."], "answer": ["He is in a hotel and is unable to sleep because the man in the adjacent room is snoring. He calls the snorer up (at this hotel, like many others, the phone numbers are based on the room number). The snorer wakes up and answers. The first man hangs up without saying anything and goes to sleep before the snorer starts snoring again."], "story_keys": "1. A man is lying awake in bed.\n2. The man makes a phone call.\n3. He doesn't say anything during the call.\n4. After the call, the man goes to sleep.", "answer_keys": "- The man is in a hotel and cannot sleep due to the snoring from the adjacent room.\n- In the hotel, phone numbers are based on room numbers, so he calls the snorer.\n- The snorer wakes up and answers the call.\n- The first man hangs up without saying anything and goes to sleep before the snorer resumes snoring.", "likes": "82% users", "solving_time": "12 minutes", "level": "5/10 medium", "date": "17 March 2018"}
{"story": ["When Liz was about to find out who killed Mario, she fell asleep. When she woke up she realized that she could no longer find it out."], "answer": ["Liz was reading a novel on the beach. The main character, Mario, had been killed and she was about to find out who had committed the crime. Before she found it out, she fell asleep with the book lying in the sand. When she woke up she saw that the tide had risen and the book had been washed away."], "story_keys": "1. Liz was on the verge of discovering who killed Mario.\n2. Liz fell asleep before she could find out.\n3. After waking up, Liz realized that she was unable to discover who the murderer was.", "answer_keys": "1. Liz reads a novel at the beach where the character Mario is killed.\n2. She falls asleep before she knows who committed the crime in the novel.\n3. When she wakes up, she finds the tide came in and washed the book away.", "likes": "82% users", "solving_time": "15 minutes", "level": "5/10 medium", "date": "17 March 2018"}
{"story": ["In the 1950s in America there was invented a chicken gun. What for? "], "answer": ["A chicken gun is a large-diameter, compressed-air cannon used to fire dead chickens at aircraft components in order to simulate high-speed bird strikes during the aircraft's flight. Jet engines and aircraft windshields are particularly vulnerable to damage from such strikes, and are the most common target in such tests. Whole, dead, standard-size chickens, as would be used for cooking, are thought to accurately simulate a large, live bird striking a plane in flight."], "story_keys": "['A chicken gun was invented in America in the 1950s.']", "answer_keys": "1. A chicken gun is a large, compressed-air cannon used to test aircraft components.\n2. It fires dead chickens to recreate high-speed bird strikes during flight.\n3. Jet engines and aircraft windshields are most vulnerable to damage from bird strikes, and are commonly tested.\n4. Standard-sized, whole, dead chickens are used to accurately replicate a large, live bird striking a plane in flight.", "likes": "81% users", "solving_time": "22 minutes", "level": "6/10 medium", "date": "10 February 2018"}
{"story": ["A woman goes to the library, takes a book and cries out."], "answer": ["The woman was a writer and she had donated one of her books to the library. She had included a 50$ bill among the pages as a gift for the first person borrowing the book. After a year, she came back to the library, took the book and saw that the bill was still there. Realizing that no one had read her book she burst into tears."], "story_keys": "- A woman goes to the library\n- The woman takes a book\n- The woman cries out", "answer_keys": "- The woman was a writer who donated one of her books to the library.\n- She included a $50 bill in the book as a gift for its first borrower.\n- After a year, she discovered the bill was still there, indicating no one had borrowed her book.\n- This realization made her burst into tears.", "likes": "81% users", "solving_time": "17 minutes", "level": "6/10 medium", "date": "17 March 2018"}
{"story": ["A man was walking with a gold ring on his finger. Suddenly robbers attacked him. They wanted to take the ring but couldn’t take it off. So, they cut off the finger and ran away. However, the man didn’t even scream. Why?"], "answer": ["He had gold teeth, and he didn’t want to show them, so that the robbers wouldn’t take them too."], "story_keys": "- A man was walking with a gold ring on his finger.\n- The man was attacked by robbers.\n- The robbers aimed to take the man's ring.\n- The robbers failed to remove the ring from the man's finger.\n- The robbers then cut the man's finger to get the ring and fled.\n- Despite this, the man didn't scream.", "answer_keys": "- The individual has gold teeth.\n- He didn't want to display his gold teeth. \n- His intent was to prevent robbers from stealing them.", "likes": "81% users", "solving_time": "8 minutes", "level": "5/10 medium", "date": "11 May 2020"}
{"story": ["While he was in the forest, a wild beast bit off his nose. But he died only 3 months later."], "answer": ["It was a snowman. A hare bit off its carrot nose, but it melted only in April."], "story_keys": "1. The person was in a forest.\n2. A wild beast bit off his nose there.\n3. Despite the injury, the person survived for three more months before dying.", "answer_keys": "['A snowman had its carrot nose bitten off by a hare, but it only melted in April.']", "likes": "81% users", "solving_time": "9 minutes", "level": "4/10 medium", "date": "18 March 2021"}
{"story": ["He died because he mixed up the colors. "], "answer": ["In Thailand if some snake bites you, doctor has to identify the snake's species in order to choose the right antidote. The tourist usually can not identify it, so doctor asks him/her what color the snake was, and using this information specialist defines snake's species. The man was colorblind, therefore he received a wrong antidote."], "story_keys": "- The individual passed away as a result of mixing up the colors.", "answer_keys": "1. In Thailand, the species of a snake that bites you needs to be identified for the right antidote.\n2. Tourists usually can't identify the species, so doctors ask the color of the snake to help identify it.\n3. A colorblind man was bitten and couldn't accurately describe the snake's color.\n4. The man received the wrong antidote due to his colorblindness obstructing accurate snake identification.", "likes": "80% users", "solving_time": "15 minutes", "level": "6/10 medium", "date": "27 January 2018"}
{"story": ["Sherlock Holmes was walking down the corridor. Suddenly he heard a woman screaming, “Please, John, don’t kill me!” A shot rang. Holmes burst into the room. In one corner lay a dead woman and a gun. In another corner stood a postman, a lawyer, and an accountant. Sherlock looked at them, approached the postman, and grabbed him: “I will arrest you for killing this woman.” It was really the postman who killed this woman, but how could Holmes know it?"], "answer": ["The postman was the only man. The lawyer and the accountant were women."], "story_keys": "- Sherlock Holmes hears a woman scream for help.\n- A gunshot can be heard, leading Holmes to quickly enter the room.\n- He finds a dead woman and a gun in one corner, and a postman, lawyer and accountant in another.\n- Holmes immediately suspects the postman is the murderer and decides to arrest him.\n- It is later confirmed that the postman did actually kill the woman.\n- The way Sherlock Holmes could identify the murderer is not explained.", "answer_keys": "1. The postman was the only male in the group.\n2. The lawyer and the accountant were women.", "likes": "80% users", "solving_time": "8 minutes", "level": "4/10 medium", "date": "11 February 2020"}
{"story": ["Bill died and went to heaven. There he saw thousands of people, who all were naked. He was looking around hoping to find someone he knew. And then he saw Adam and Eve."], "answer": ["Adam and Eve were the only ones who didn’t have belly-buttons."], "story_keys": "1. Bill died and went to heaven.\n2. He saw thousands of people in heaven who were all naked. \n3. Bill was hoping to find someone he knew.\n4. He saw Adam and Eve in heaven.", "answer_keys": "Adam and Eve didn't have belly-buttons.", "likes": "80% users", "solving_time": "9 minutes", "level": "6/10 medium", "date": "03 September 2022"}
{"story": ["A man and a woman got married. After the wedding they abandoned all their activities, that were bringing them money, and only had fun. As a result, in three years they became millionaires."], "answer": ["Before the wedding, they were billionaires. Therefore during these three years they spent a lot of money and as a result became millionaires."], "story_keys": "A man and a woman got married, ceased their income-generating activities to only have fun, yet surprisingly became millionaires in three years.", "answer_keys": "- The individuals were billionaires before the wedding.\n- During the span of three years, they spent a significant amount of their wealth. \n- Their spending resulted in their wealth decreasing from billions to millions.", "likes": "79% users", "solving_time": "5 minutes", "level": "4/10 medium", "date": "18 January 2018"}
{"story": ["If the wind hadn't blown so strongly that night, Angela would still be alive. "], "answer": ["As it was windy, Angela decided to go to a field to fly her kite. At twilight, she could not see the nearby transmission tower. When her kite got tangled in the cables and she tried to untangle them, she was electrocuted. "], "story_keys": "1. The wind blew strongly on a particular night.\n2. Angela has passed away.\n3. Angela's death is suggested to be connected to the strong wind.", "answer_keys": "1. It was windy so Angela decided to go fly her kite in a field.\n2. At twilight, she couldn't see a nearby transmission tower.\n3. Her kite got tangled in the cables of the transmission tower.\n4. Angela was electrocuted when she tried to untangle her kite from the cables.", "likes": "79% users", "solving_time": "12 minutes", "level": "5/10 medium", "date": "04 March 2018"}
{"story": ["An avid birdwatcher sees an unexpected bird. Soon he’s dead. How come?"], "answer": ["He is a passenger in an airplane and sees the bird get sucked into an engine at 20,000 feet."], "story_keys": "1. Individual is an avid birdwatcher.\n2. They spot an unexpected bird.\n3. Shortly after, the birdwatcher is dead.\n4. The question arises: What caused the birdwatcher's death?", "answer_keys": "- An individual is a passenger on an airplane.\n- They witness a bird getting sucked into the airplane's engine.\n- The incident occurs at 20,000 feet.", "likes": "79% users", "solving_time": "7 minutes", "level": "4/10 medium", "date": "03 March 2018"}
{"story": ["She thought that it was the best day of her life moments before she died."], "answer": ["At the end of a theather play, the lead actress appeared and the audience began to applaud. At that time there was a failure with the scenery and it started to collapse on stage. The oublic rose from their seats screaming, trying to warn the actress but she thought it was a standing ovation and she was crushed. "], "story_keys": "1. The woman thought it was the best day of her life.\n2. These thoughts occurred moments before she died.", "answer_keys": "- The lead actress appeared at the end of a theater play and received applause.\n- There was a failure with the stage scenery which started to collapse. \n- The audience tried to warn the actress by screaming and rising from their seats. \n- The actress misinterpreted the audience's reaction as a standing ovation. \n- The actress was crushed due to the stage collapse.", "likes": "79% users", "solving_time": "17 minutes", "level": "6/10 medium", "date": "17 March 2018"}
{"story": ["Jack goes on a trip with his compass. After a long walk, he stops to eat a sandwich. He is not able to find his way back afterwards.  "], "answer": ["Jack was a scientist who worked near the North Pole. When he went walking, he walked towards the north and he stopped to eat his sandwich exactly at the North Pole. When he tried to return home, his compass was useless, since every direction pointed South."], "story_keys": "['Jack goes on a trip with his compass', 'He stops to eat a sandwich after a long walk', 'Jack is not able to find his way back afterwards.']", "answer_keys": "- Jack is a scientist who works near the North Pole.\n- He walked towards the North until he reached the North Pole.\n- He ate his sandwich exactly at the North Pole.\n- When Jack tried to return home, his compass was useless because every direction pointed South.", "likes": "78% users", "solving_time": "12 minutes", "level": "4/10 medium", "date": "03 March 2018"}
{"story": ["Every day he puts on green lipstick. But almost no one notices it."], "answer": ["In the 20th century the television was still black and white, and cameras had red filters, which absorbed red color of the image, i.e., red lipstick couldn’t be seen on the lips. Therefore, TV broadcasters had to make up their lips with green lipstick to make them look more expressive."], "story_keys": "1. A man applies green lipstick daily.\n2. Nearly nobody acknowledges or notices the man's green lipstick.", "answer_keys": "- In the 20th century, television was black and white. \n- Cameras used red filters that absorbed the red color from images.\n- As a result, red lipstick was not visible on lips.\n- TV broadcasters had to use green lipstick to make lips look more expressive.", "likes": "78% users", "solving_time": "21 minutes", "level": "5/10 medium", "date": "25 August 2019"}
{"story": ["A woman misread something and never saw another person again."], "answer": ["The woman was a scientist working in a laboratory. She accidentally misread a bottle label before adding the chemical to another. The mixture exploded, blinding her permanently. She could never see another person, or anything at all ever again."], "story_keys": "1. A woman misread something.\n2. She never saw another person again.", "answer_keys": "1. The woman was a scientist working in a laboratory.\n2. She misread a bottle label and mixed the wrong chemicals. \n3. The mistaken mixture exploded, causing her permanent blindness.\n4. The accident resulted in her losing all her sight, never being able to see anything again.", "likes": "78% users", "solving_time": "6 minutes", "level": "4/10 medium", "date": "16 January 2022"}
{"story": ["Three dead men sitting at a table in a room. On the table, there are playing cards and a gun. What happened?"], "answer": [], "story_keys": "1. Three men are dead, sitting at a table in a room.\n2. There are playing cards and a gun on the table.\n3. The situation prompts the question of what happened.", "answer_keys": "You haven't provided any sentence. Please provide a sentence you want me to extract key points from.", "likes": "78% users", "solving_time": "22 minutes", "level": "6/10 medium", "date": "03 February 2022"}
{"story": ["A man, who was examining some school, noticed that any time a teacher was asking a question, lots of pupils were ready to answer. Moreover, every time the teacher was choosing another person and the answer was always right."], "answer": ["The teacher told pupils to raise up their hands no matter what question would be asked. But if they khew the answer, they should raise the right hand, otherwise - the left one. Therefore the teacher could choose among the pupils who knew the answer. "], "story_keys": "- A man was observing a school.\n- He noticed that many pupils were always ready to answer when a teacher asked a question.\n- The teacher always picked different students to answer. \n- The chosen students were always correct in their answers.", "answer_keys": "- The teacher instructed pupils to raise their hands for every question.\n- Right hand raise indicates knowing the answer, left hand raise indicates not knowing.\n- This method helps the teacher identify the pupils who know the answer.", "likes": "77% users", "solving_time": "8 minutes", "level": "5/10 medium", "date": "10 February 2018"}
{"story": ["In some city an amount of people injured in car accidents was very high. Then it was decided by administration to make the using of seat belts oblidatory. People started to obey this rule. But the amount of crash accidents remained the same. Moreover, the number of injured people who addressed to the hospital even increased. "], "answer": ["The adopted law decreased the number of accidents. A lot of people who would die without seat belt stayed alive but got injured and therefore they went to the hospital. So the number of patients increased. "], "story_keys": "1. An unidentified city had a high rate of people injured in car accidents.\n2. The city's administration made the use of seat belts mandatory to address this issue.\n3. Despite compliance to the new seat belt rule, the amount of car accidents stayed the same.\n4. Instead of decreasing, the number of injured people from car accidents who sought medical attention increased.", "answer_keys": "1. The adopted law led to a decrease in the number of accidents.\n2. Many people who would have died in accidents without seat belts survived but were injured.\n3. Due to these injuries, there was an increase in the number of hospital patients.", "likes": "77% users", "solving_time": "6 minutes", "level": "4/10 medium", "date": "10 February 2018"}
{"story": ["A couple of dancers die around a dance competition."], "answer": ["During a tango competition, another - very competitive - couple poisoned the rose that another couple passed each other during their routine, so that the couple would die. The poisoned rose killed this couple and the others won the contest."], "story_keys": "- A couple of dancers die\n- Incident occurred around a dance competition", "answer_keys": "1. A tango competition is taking place.\n2. A very competitive couple poisoned a rose used by another couple in their routine.\n3. The aim of the poisoning was to kill the other couple.\n4. The couple who received the poisoned rose died.\n5. The couple who poisoned the rose won the contest.", "likes": "77% users", "solving_time": "5 minutes", "level": "5/10 medium", "date": "17 March 2018"}
{"story": ["The Venezuelan police made a few attempts to arrest a well-known bandit. They knew where he lived. From time to time they got the arrest warrant and approached his house. When they entered the house, he locked in the bedroom. The police had nothing to do but to leave empty-handed."], "answer": ["His house was on the border between Venezuela and Colombia. Although the front door and half of the house were on the territory of Venezuela, the bedroom was located on the territory of Colombia. The Venezuelan police had no jurisdiction in Colombia, so the police couldn't arrest him while he was in the bedroom."], "story_keys": "- Venezuelan police tried to arrest a well-known bandit multiple times.\n- The police knew where the bandit lived.\n- They occasionally obtained an arrest warrant and visited his house.\n- As the police entered the house, the bandit would lock himself in the bedroom.\n- Left with no options, the police had to leave empty-handed each time.", "answer_keys": "- The man's house is located on the border of Venezuela and Colombia.\n- The front door and half of the house are in Venezuela, while the bedroom is in Colombia.\n- The Venezuelan police cannot arrest him when he is in his bedroom, because they do not have jurisdiction in Colombia.", "likes": "76% users", "solving_time": "7 minutes", "level": "5/10 medium", "date": "20 July 2019"}
{"story": ["A hospital director recently confirmed that many that many of people admitted to his hospital were not ill at all. They were perfectly healthy, yet were given hospital care and treatment. "], "answer": ["The hospital was a maternity hospital and all those admitted were pregnant women."], "story_keys": "- A hospital director confirmed that many people admitted to his hospital were not ill.\n- These healthy individuals were still given hospital care and treatment.", "answer_keys": "- The hospital was specifically a maternity hospital.\n- All the admitted patients in this hospital were pregnant women.", "likes": "76% users", "solving_time": "10 minutes", "level": "4/10 medium", "date": "10 February 2018"}
{"story": ["Sally was sleeping when she was awoken by Jack. She walked to the door and found a letter. She read it and began to cry. She now knew that her boyfriend would never see her again. Why?"], "answer": ["Sally's boyfriend had recently undgone eye surgery. Jack, her boyfriend's guide-dog, awoke her after the postman had delivered a letter. The letter was from the doctor's. The letter was in response to her boyfriends medical tests that confirmed the surgery was unsuccesful and he would now be fully blind."], "story_keys": "- Sally was sleeping but was awoken by Jack.\n- She found a letter at the door.\n- Sally read the letter and started crying.\n- The letter communicated that her boyfriend would never see her again.", "answer_keys": "1. Sally's boyfriend recently had eye surgery.\n2. Jack, her boyfriend's guide dog, alerted her to a delivered letter.\n3. The letter was from the doctor's office.\n4. The letter confirmed that her boyfriend's medical tests showed the surgery was unsuccessful.\n5. As a result of the unsuccessful surgery, the boyfriend would now be fully blind.", "likes": "76% users", "solving_time": "12 minutes", "level": "4/10 medium", "date": "18 March 2021"}
{"story": ["Andrew decided to spend the evening with his family. He bought tickets for the whole family, but his ticket cost him his life."], "answer": ["Andrew took his family to the zoo. He found the tickets too expensive. So, he decided not to buy a ticket for himself. He climbed over the wall but got into a cage with a lion. When he realized what happened, it was too late."], "story_keys": "- Andrew decided to spend an evening with his family.\n- He bought tickets for the whole family.\n- His own ticket ended up costing him his life.", "answer_keys": "1. Andrew took his family to the zoo.\n2. He found the tickets too expensive.\n3. Andrew decided not to buy a ticket for himself.\n4. He climbed over the wall to get into the zoo.\n5. He accidentally got into a cage with a lion.\n6. When Andrew realized his situation, it was too late.", "likes": "75% users", "solving_time": "14 minutes", "level": "5/10 medium", "date": "18 January 2023"}
{"story": ["A man dies of thirst at home. How could it happen?"], "answer": ["The man’s home was a yacht, in which he was travelling around the world. While sailing in the ocean, he ran out of fresh water much faster than he expected."], "story_keys": "1. A man dies at home from thirst.\n2. There is curiosity/unsureness about how this could occur.", "answer_keys": "['The man was travelling around the world in his yacht home', 'He ran out of fresh water faster than expected while sailing in the ocean.']", "likes": "75% users", "solving_time": "10 minutes", "level": "5/10 medium", "date": "31 October 2023"}
{"story": ["Jimmy hid a treasure but when he wanted to recover it, he was not able to."], "answer": ["Jimmy buried a treasure when he was 8 years old. He had written a note when he was younger with how many steps he would take to find his treasure. But now that he was grown up, his stride was much longer and he could never find his treasure."], "story_keys": "- Jimmy hid a treasure and later was unable to recover it.", "answer_keys": "1. Jimmy buried a treasure when he was 8 years old.\n2. He wrote a note detailing the number of steps to find this treasure.\n3. As an adult, Jimmy's stride has lengthened, making it difficult for him to find his treasure using the steps mentioned in his note.", "likes": "75% users", "solving_time": "20 minutes", "level": "6/10 medium", "date": "17 March 2018"}
{"story": ["Everybody knew that if Julia took one step forward, she would die, but nobody told her."], "answer": ["Julia was a rat on which scientists were conducting an experiment. She was trapped in a labyrinth full of traps and was standing right in front of one."], "story_keys": "1. Everyone knew about the potential danger to Julia's life if she moved forward.\n2. Despite their knowledge, no one informed Julia about this danger.", "answer_keys": "- Julia is a rat used by scientists for an experiment.\n- She is trapped in a labyrinth full of traps.\n- Julia is standing right in front of one of the traps.", "likes": "75% users", "solving_time": "9 minutes", "level": "4/10 medium", "date": "29 April 2023"}
{"story": ["A man comes breathless out of a house, closes the door and goes quickly down stairs. Then he walks two blocks to get to another house, enters and breathes relieved. "], "answer": ["The man had just moved. He arrived to his new home with the last boxes and he breathed a sigh of relief because he had finished. "], "story_keys": "- A man exits a house quickly and breathlessly.\n- He closes the door and rushes down the stairs.\n- He walks two blocks to another house.\n- The man enters the second house and expresses relief.", "answer_keys": "- The man recently moved to a new home.\n- He has finished unpacking his boxes. \n- Completing the moving process made him feel relieved.", "likes": "74% users", "solving_time": "14 minutes", "level": "5/10 medium", "date": "18 January 2018"}
{"story": ["Paul comes home tired. He goes to his room and turns off the light to sleep. After a while, feeling uneasy, he turns on the light and looks around. He turns the light back off and tries to sleep again. After repeating this several times, he takes a look under his bed and finds a dead body."], "answer": ["A thief was stealing from Paul's home. When Paul arrived home, the thief hid under the bed. The tension became too much and the thief suffered a sudden heart attack Paul was unable to sleep due to the ticking of the thief's wristwatch."], "story_keys": "['Paul comes home tired and tries to sleep', 'Feeling uneasy, Paul repeatedly turns on the light to look around', 'Eventually, Paul finds a dead body under his bed.']", "answer_keys": "1. A thief was stealing from Paul's home.\n2. Paul arrived home while the theft was in progress.\n3. The thief hid under Paul's bed.\n4. The thief experienced a heart attack due to high tension.\n5. Paul couldn't sleep because of the noise from the thief's wristwatch.", "likes": "73% users", "solving_time": "16 minutes", "level": "6/10 medium", "date": "04 January 2018"}
{"story": ["Tim is sailing his boat when his watch falls overboard. He is a great diver. However, he does not manage to retrieve the watch."], "answer": ["Tim was sailing on the Dead Sea. Due to the high salt concentration, he couldn't dive deep enough to get his watch back."], "story_keys": "['Tim's watch falls overboard while he is sailing his boat', 'Despite being a great diver, Tim doesn't manage to retrieve his watch.']", "answer_keys": "1. Tim was sailing on the Dead Sea.\n2. The Dead Sea has a high salt concentration.\n3. Tim lost his watch in the Dead Sea.\n4. Because of the high salt concentration, he couldn't dive deep enough to retrieve it.", "likes": "73% users", "solving_time": "15 minutes", "level": "6/10 medium", "date": "05 January 2018"}
{"story": ["A woman finishes getting dressed and dies."], "answer": ["There was a very venomous spider in one of her shoes. When the woman put on her shoes, the spider bit her."], "story_keys": "1. A woman finishes getting dressed.\n2. The woman dies.", "answer_keys": "- A very venomous spider was present in a woman's shoe.\n- The woman was bitten by the spider when she put on the shoe.", "likes": "73% users", "solving_time": "15 minutes", "level": "4/10 medium", "date": "04 March 2018"}
{"story": ["A woman walks into a pet store to buy a parrot. The seller offers her one, telling her that it can repeat everything it hears. Some days later the woman - feeling cheated - goes back into the store to get her money back. However, she comes back home with the parrot and not her money. "], "answer": ["The parrot was deaf. It could not repeat anything, since it could not hear anything. However, the seller did not return the money to the woman because he never lied to her."], "story_keys": "1. A woman visits a pet store to purchase a parrot.\n2. The seller claims that this parrot can mimic every sound it hears.\n3. After some days, the woman feels deceived and returns to the store for a refund.\n4. However, the woman leaves the store with the parrot and not her refund.", "answer_keys": "- The parrot was deaf and couldn't repeat anything because it couldn't hear.\n- Despite this, the seller refused to return the woman's money because he didn't lie to her.", "likes": "73% users", "solving_time": "9 minutes", "level": "4/10 medium", "date": "17 March 2018"}
{"story": ["A woman went on vacation and asked a friend to look after her cat. A week later, 8 cats were running around the apartment!"], "answer": ["The next day this cat ran away, and the friend had to start looking for it. Since he did not know the cat very well, he had to keep all the similar cats that he had seen and wait for the friend who was supposed to identify the right pet."], "story_keys": "- A woman asked a friend to look after her cat while on vacation.\n- A week later, there were 8 cats in the apartment.", "answer_keys": "1. The cat belonging to the friend ran away the next day.\n2. The friend started searching for the missing cat.\n3. The friend did not know the cat very well.\n4. The friend kept all similar cats he found during his search.\n5. He was waiting for his friend to identify the correct missing pet.", "likes": "72% users", "solving_time": "7 minutes", "level": "4/10 medium", "date": "18 January 2018"}
{"story": ["In the middle of the ocean is a yacht. Several corpses are floating in the water nearby."], "answer": ["A group of people were on an ocean voyage in a yacht. One day, they decided to go swimming — they put on their swimsuits and dove off the side. They discovered belatedly that they have forgotten to put a ladder down the side of the yacht and were unable to climb back in, so they drowned."], "story_keys": "1. A yacht is situated in the middle of the ocean.\n2. Several corpses are floating in the water near the yacht.", "answer_keys": "- A group of people were on an ocean voyage in a yacht.\n- They decided to go swimming and dove off the side of the yacht.\n- They realized too late that they had forgotten to put a ladder down the side of the yacht.\n- They were unable to climb back into the yacht and drowned.", "likes": "72% users", "solving_time": "17 minutes", "level": "4/10 medium", "date": "11 August 2019"}
{"story": ["A man wearing a balaclava runs out of a museum carrying a painting under his arm. A police officer sees him, shoots him dead and commits suicide soon after. A couple of days later, the man with the painting is buried and named favorite son of the city. "], "answer": ["During a cold spell, there is fire in a museum and its director tried to save the most valuable painting from the museum's collection. The police officer had not noticed the fire and thought the man with the painting was a thief. He told him to freeze but since the director was deaf he did not hear the police officer. When the police officer realized what he had done, he committed suicide. "], "story_keys": "1. A man wearing a balaclava steals a painting from a museum.\n2. A police officer witnesses the theft and shoots the thief dead. \n3. The police officer then commits suicide shortly afterwards. \n4. A few days later, the thief is buried and named as the city's favorite son.", "answer_keys": "1. During a cold spell, a fire occurs in a museum.\n2. The museum director attempts to save the most valuable painting.\n3. A police officer, unaware of the fire, suspects the director of stealing the painting.\n4. The police officer orders the director to stop, but the director is deaf and doesn't hear him.\n5. Realizing his mistake, the police officer commits suicide.", "likes": "72% users", "solving_time": "8 minutes", "level": "6/10 medium", "date": "03 March 2018"}
{"story": [], "answer": [], "story_keys": "As there is no provided sentence, I'm unable to identify any key points. Could you please provide a sentence?", "answer_keys": "You didn't provide a sentence for me to analyze. Can you please provide it?", "likes": "72% users", "solving_time": "11 minutes", "level": "6/10 medium", "date": "13 September 2020"}
{"story": ["When Martin woke up that morning, he was surprised to see the door open. As soon as he crossed the threshold he got beheaded. "], "answer": ["Martin was a canary that had been living in his cage for four months. Silvester - a cat - was waiting for his opportumity to catch Martin and eat him. When their owner left the cage door open by mistake Martin flew out of it and Silvester bit off his small head."], "story_keys": "1. Martin woke up one morning to find the door open.\n2. Upon crossing the threshold, Martin was beheaded.", "answer_keys": "1. Martin is a canary that has been living in a cage for four months.\n2. Silvester is a cat that is waiting to catch and eat Martin.\n3. The cage door was left open by mistake by their owner.\n4. Martin flew out of the cage.\n5. Silvester bit off Martin's small head.", "likes": "70% users", "solving_time": "10 minutes", "level": "4/10 medium", "date": "04 January 2018"}
{"story": ["One person decided to play golf with Nick Faldo, imposing one condition - he will choose the time and the place for a match. Nick agreed. As a result this person beat the champion. "], "answer": ["This person was blind and he chose to play this match at moonless night. He could play golf perfectly well in dark. (It is true, blind people can play golf with the help of not blind people). Such conditions were unusual for Nick so he lost. "], "story_keys": "- One person chose to play golf with Nick Faldo, setting the condition that they decide the time and place. \n- Nick Faldo agreed to this condition. \n- The person who initiated the match ended up winning against Nick Faldo.", "answer_keys": "- The person is blind and chose to play a match at moonless night.\n- He can play golf perfectly well in the dark.\n- Blind people can play golf with the assistance of non-blind people.\n- The unusual conditions led to Nick losing the match.", "likes": "70% users", "solving_time": "25 minutes", "level": "6/10 medium", "date": "10 February 2018"}
{"story": ["Cindy is amongst a crowd of people when she is murdered. However, nobody notices her cries."], "answer": ["Cindy was in a movie theater, watching a horror movie. A very scary scene started. While everybody was screaming the murderer - who was behind her - was killing her. "], "story_keys": "1. Cindy is murdered within a crowd of people.\n2. Nobody notices her cries during the murder.", "answer_keys": "1. Cindy was in a movie theater watching a horror movie.\n2. A very scary scene started in the movie.\n3. While the audience screamed, Cindy was being murdered by the person sitting behind her.", "likes": "70% users", "solving_time": "6 minutes", "level": "4/10 medium", "date": "04 March 2018"}
{"story": ["A man walks up to a cactus, looks at a piece of paper pinned there, and kills himself."], "answer": ["The man has been wandering lost in the desert. He fears he has been walking in circles. To test this, he pins a blank piece of paper to a cactus and sets off walking. When he encounters the paper again, his fears are confirmed and he knows he will never find his way out."], "story_keys": "1. A man approaches a cactus.\n2. He observes a piece of paper pinned on the cactus.\n3. The man commits suicide.", "answer_keys": "1. A man is lost in the desert, suspecting he's been walking in circles.\n2. He pins a blank piece of paper to a cactus to test his suspicion.\n3. The man encounters the same paper on his path, confirming he's been walking in circles.\n4. He becomes certain that he will never find his way out of the desert.", "likes": "69% users", "solving_time": "10 minutes", "level": "4/10 medium", "date": "22 January 2018"}
{"story": [], "answer": [], "story_keys": "You didn't provide a sentence. Please, share the sentence you want to analyze.", "answer_keys": "You have not provided a sentence for me to analyze. Please provide a sentence.", "likes": "66% users", "solving_time": "6 minutes", "level": "6/10 medium", "date": "18 January 2018"}
{"story": [], "answer": ["One of the “chess players” had no kings on the board."], "story_keys": "You didn't provide a sentence for me to analyze.", "answer_keys": "- A \"chess player\" had no kings on the board.", "likes": "66% users", "solving_time": "2 minutes", "level": "4/10 medium", "date": "20 January 2018"}
{"story": [], "answer": ["He stabbed himself with an icicle."], "story_keys": "You didn't mention any sentence. Could you please provide the sentence you'd like me to analyse?", "answer_keys": "- The individual inflicted self-harm.\n- The object used for self-harm was an icicle.", "likes": "66% users", "solving_time": "8 minutes", "level": "5/10 medium", "date": "20 March 2019"}
{"story": ["In the front of a car, a woman is found dead. There is a gun in the back seat, out of her reach. The windows are closed and the doors are all locked. "], "answer": ["The woman was sitting in a convertible and the top was down. The murderer shot her and threw the gun into the back seat of the car."], "story_keys": "-A woman is found dead in the front of a car.\n-There is a gun in the back seat, beyond her reach.\n-The car's windows are closed and all its doors are locked.", "answer_keys": "1. A woman was sitting in a convertible with the top down.\n2. She was shot by a murderer.\n3. The murderer threw the gun into the back seat of the car.", "likes": "66% users", "solving_time": "18 minutes", "level": "4/10 medium", "date": "17 March 2018"}
{"story": ["Landlords used to delay payment to people who built and repaired houses or even booted them out without money. But the builders came up with an uncommon move, which immediately made the landlords pay them in full. What did they do?"], "answer": ["When laying a foundation for a house or repairing it, they put a raw egg in a certain place. After a while, it began to rot. If the landlord called the builders and paid for their work, they took the egg away. If he booted them out, the egg eventually began to stink, and it was very difficult to find where it had been hidden."], "story_keys": "- Landlords would delay payments or not pay at all to builders for constructing or repairing houses.\n- Builders came up with a unique solution that forced landlords to pay them in full immediately.\n- Text does not reveal what the specific solution the builders came up with.", "answer_keys": "1. A raw egg is placed in a certain location when laying a foundation for a house or repairing it.\n2. The egg begins to rot after a while. \n3. If the landlord contacts the builders and pays for their work, they remove the egg.\n4. If the builders were sent away without payment, the rotting egg remains and begins to smell.\n5. It's difficult to find the hidden rotten egg.", "likes": "66% users", "solving_time": "11 minutes", "level": "5/10 medium", "date": "16 April 2018"}
{"story": ["Camellia brought Valmont some wine. He looked at his watch, drank and died."], "answer": ["Valmont was hopelessly in love with Camellia, but she didn’t reciprocate. One day she offered Valmont a cruel game: she put some poison into one of the two glasses of wine, and Valmont had to drink any of them. If he survived, Camelia agreed to marry him."], "story_keys": "1. Camellia gave Valmont some wine.\n2. Valmont checked his watch.\n3. Valmont drank the wine.\n4. After drinking the wine, Valmont died.", "answer_keys": "- Valmont is hopelessly in love with Camelia.\n- Camelia does not reciprocate Valmont's feelings.\n- Camelia offers Valmont a dangerous game involving poison.\n- Poison is placed in one of two glasses of wine and Valmont has to drink from one.\n- If Valmont survives this game, Camelia has agreed to marry him.", "likes": "66% users", "solving_time": "120 minutes", "level": "6/10 medium", "date": "03 April 2021"}
{"story": ["One day Mark hid his watch. What for?"], "answer": [], "story_keys": "Mark hid his watch one day.", "answer_keys": "You didn't provide a sentence to evaluate. Could you please provide a sentence you need the key points from?", "likes": "66% users", "solving_time": "120 minutes", "level": "5/10 medium", "date": "03 April 2021"}
{"story": ["The husband lied to his wife that there were weapons buried in the backyard of their house. What for?"], "answer": ["He was serving a sentence in prison and knew that his correspondence was read. He wanted to make his wife a birthday gift – to help her dig up a vegetable garden."], "story_keys": "The key point is: The husband deceived his wife by saying there were weapons buried in their backyard.", "answer_keys": "1. The man was serving a sentence in prison.\n2. He was aware his correspondence was being monitored.\n3. He desired to gift his wife for her birthday.\n4. The gift he planned was helping her dig up a vegetable garden.", "likes": "66% users", "solving_time": "5 minutes", "level": "6/10 medium", "date": "16 April 2022"}
{"story": ["Micheal and his wife were having a heated argument that lasted hours. After some time they both left the house to go outside. Neither of them ever returned."], "answer": ["While they were arguing they forgot that they had food cooking in the kitchen. The unattended stove caused a fire that began spreading through the house. They left the house as soon as they realised it was burning. The house burned to the ground so they could never go back."], "story_keys": "- Micheal and his wife were having a long heated argument.\n- They both left the house to go outside after the argument. \n- Neither Micheal nor his wife ever returned to the house.", "answer_keys": "1. People were arguing and forgot about their cooking food.\n2. The unattended stove caused a fire that began to spread.\n3. They left the house upon realizing it was on fire.\n4. The house burned to the ground and they couldn't return.", "likes": "66% users", "solving_time": "5 minutes", "level": "5/10 medium", "date": "17 December 2023"}
{"story": ["A businessman witnesses a kidnapping. However, when he tells the police, they do not believe him. "], "answer": ["After leaving the dentist, the witness was unable to speak properly, since he had numb mouth. The policemen thought that the man was drunk and did not believe a word he said."], "story_keys": "- A businessman witnesses a kidnapping.\n- The businessman reports the kidnapping to the police.\n- The police do not believe the businessman's report of the kidnapping.", "answer_keys": "1. After leaving the dentist, the witness had a numb mouth and couldn't speak properly.\n2. The policemen believed the witness was drunk due to his impaired speech. \n3. The policemen did not believe anything the witness said due to their misunderstanding of his condition.", "likes": "65% users", "solving_time": "17 minutes", "level": "6/10 medium", "date": "04 January 2018"}
{"story": ["Two devices are commonly used by people. They are created for the same purpose. But one of them has lots of details and another does not has any. What are these things? "], "answer": ["One of these devices is hourglass. Another one is sundial. "], "story_keys": "- Two devices common amongst people\n- Devices created for same purpose\n- One device has many details\n- Other device has no details\n- Inquiries about what these devices are", "answer_keys": "- There are two devices mentioned: hourglass and sundial.", "likes": "64% users", "solving_time": "19 minutes", "level": "6/10 medium", "date": "10 February 2018"}
{"story": ["A woman is planning to kill her husband during dinner. However, she commits suicide while preparing it."], "answer": ["She was planning to kill him by poisoning the food with some pills that she had in her bag. When she went to grab them, she noticed that they were not there, and that her son had swallowed them, thinking they were sweets. She couldn't bear it and took her own life. "], "story_keys": "1. A woman plans to murder her husband during dinner.\n2. She ends up committing suicide while preparing the meal.", "answer_keys": "1. The woman intended to kill a man by poisoning his food with pills.\n2. She discovered the pills were missing from her bag.\n3. She realized her son had mistaken the pills for sweets and ingested them.\n4. Devastated by her son's accident, she committed suicide.", "likes": "63% users", "solving_time": "12 minutes", "level": "6/10 medium", "date": "04 March 2018"}
{"story": ["When the priest stopped talking, Bobby died."], "answer": ["Bobby was a little hamster who had come to the church along with Tom, his 9-year-old owner. When the priest was speaking in front of the believers, the little hamster escaped from the child's lap and went to the altar. When the priest finished speaking and headed towards his chair, he did not see Bobby and crushed him with his foot."], "story_keys": "1. A priest was talking.\n2. Bobby died after the priest stopped talking.", "answer_keys": "- Bobby is a hamster owned by a 9-year-old named Tom.\n- They went to a church where a priest was speaking to the believers.\n- Bobby escaped from Tom's lap and went to the altar during the sermon.\n- The priest inadvertently crushed Bobby with his foot, not seeing him when he went to sit down.", "likes": "62% users", "solving_time": "17 minutes", "level": "5/10 medium", "date": "18 January 2018"}
{"story": ["A man designed a device into which you can insert colored paper, and then get the ideal 100$. Experts can not distinguish them from the real ones. How does he do that, and why does he sell this device?"], "answer": ["The man sells this device to the thief, convincing him that it prints counterfeit dollars that are indistinguishable from the real ones. He demonstrates the machine by inserting green paper into it. But green paper - this is actually real 100$, but richly painted in green. The machine simply removes green paint from them."], "story_keys": "- A man has designed a device that can transform colored paper into perfect counterfeit 100$ notes.\n- The counterfeits are so good that even experts can't distinguish them from real notes.\n- The motive behind selling this device and the method of its operation are unknown.", "answer_keys": "1. A man sells a device to a thief, claiming it can print counterfeit dollars. \n2. He convinces the thief that the counterfeit money is identical to real dollars.\n3. To demonstrate, the man inserts green paper into the device.\n4. The green paper is actually genuine 100$ bills that have been painted green.\n5. The device merely removes the green paint from the bills, creating the illusion of printing counterfeit money.", "likes": "60% users", "solving_time": "15 minutes", "level": "5/10 medium", "date": "27 January 2018"}
{"story": ["Michael manages to get shot; in doing so he saves his own life."], "answer": ["Michael was a soldier on the battlefront. The day of a big attack was approaching. When none of the other soldiers were looking, he put out an arm, so that the enemy would shoot at it. He was then taken to the hospital, and his life was no longer in danger."], "story_keys": "['Michael gets shot', 'He saves his own life by getting shot.']", "answer_keys": "- Michael was a soldier on the battlefront.\n- A big attack was approaching on that day. \n- He purposefully exposed his arm to attract enemy fire when other soldiers were not paying attention.\n- Michael was taken to the hospital as a result. \n- This move saved Michael's life from the upcoming danger.", "likes": "60% users", "solving_time": "22 minutes", "level": "4/10 medium", "date": "03 March 2018"}
{"story": ["A woman starves to death despite being surrounded by food."], "answer": ["The woman worked in the stores of a large food company. During the holiday period, she was alone and locked herself in by accident. As all the food was canned and she had nothing to open the cans with, she starved to death."], "story_keys": "1. A woman starves to death.\n2. She was surrounded by food.", "answer_keys": "1. The woman was an employee at a large food company's store.\n2. She accidentally locked herself in the store during the holiday period.\n3. Despite being surrounded by canned food, she had no tools to open them.\n4. Consequently, she starved to death.", "likes": "60% users", "solving_time": "8 minutes", "level": "4/10 medium", "date": "17 March 2018"}
{"story": ["A car without a driver moves; a man dies. How come?"], "answer": ["The murderer sets the car on a slope above the hot dog stand where the victim works. He then wedges an ice block in the car to keep the brake pedal down, and puts the car in neutral, after which he flies to another city to avoid suspicion. It's a warm day; when the ice melts, the car rolls down the hill and strikes the hot dog man at his roadside stand, killing him."], "story_keys": "1. A car is moving without a driver.\n2. A man dies as a result.", "answer_keys": "1. The murderer sets a car on a slope above a hot dog stand.\n2. The hot dog stands is where the victim works.\n3. An ice block is wedged in the car to keep the brake pedal down.\n4. The car is put into neutral.\n5. The murderer then flies to another city to avoid suspicion.\n6. On a warm day, the ice melts, and the car rolls down the hill.\n7. The car strikes and kills the hot dog man at his stand.", "likes": "60% users", "solving_time": "14 minutes", "level": "6/10 medium", "date": "19 January 2022"}
{"story": ["Bill shot the man, but was not punished. Why?"], "answer": ["The man was a film actor. According to the script, Bill was supposed to “shoot” him."], "story_keys": "1. Bill shot a man.\n2. Bill was not punished for his action. \n3. The reason behind Bill not being punished is being questioned.", "answer_keys": "- The man is a film actor.\n- According to a script, a character named Bill was supposed to \"shoot\" him.", "likes": "60% users", "solving_time": "7 minutes", "level": "4/10 medium", "date": "20 December 2023"}
{"story": ["The man was walking along the rails and suddenly he saw a train coming towards him. Then he ran like hell to meet the approaching train."], "answer": ["The man was in a tunnel and, in order to save his own life, he had to run along the rails to meet the train. When the tunnel was over, he was able to jump off the rails. And thanks to that, he remained alive."], "story_keys": "1. A man was walking along the rails.\n2. He saw a train coming towards him.\n3. He ran to meet the approaching train.", "answer_keys": "- The man was in a tunnel where he needed to run along the rails to save his life.\n- The threat was a train coming through the tunnel.\n- After the tunnel ended, the man was able to jump off the rails.\n- This action allowed the man to survive.", "likes": "58% users", "solving_time": "16 minutes", "level": "5/10 medium", "date": "18 January 2018"}
{"story": ["Over 80 percent of Greenland is covered in ice. But why then it was called Greenland (a green land)? "], "answer": ["The name Greenland comes from Scandinavian settlers. In the Norse sagas, it is said that Erik the Red was exiled from Iceland for murder. He set out in ships to find land rumoured to be to the northwest. After settling there, he named the land Grfnland (Greenland) to attract more people to settle there. "], "story_keys": "- Over 80 percent of Greenland is covered in ice.\n- There is a question of why it was named Greenland implying a green land, despite the major part of it being ice-covered.", "answer_keys": "1. The name Greenland originates from Scandinavian settlers.\n2. Erik the Red, exiled from Iceland for murder, is attributed with naming Greenland.\n3. Erik the Red travelled northwest from Iceland in search of rumoured land.\n4. Once Erik the Red settled on the land, he named it Grfnland or Greenland.\n5. The land was intentionally named Greenland in order to attract more settlers.", "likes": "57% users", "solving_time": "6 minutes", "level": "4/10 medium", "date": "10 February 2018"}
{"story": ["Peter wins the raffle and commits suicide. "], "answer": ["A group of people were snowed in. They decided to do a raffle to decide who should die so the others could eat his/her corpse to stay alive. Peter's name was selected so he had to take his own life."], "story_keys": "- Peter wins a raffle \n- Peter commits suicide", "answer_keys": "1. A group of people were trapped due to heavy snowfall.\n2. They decided to draw lots to determine who should die to provide food for the others.\n3. Peter's name was selected in the raffle.\n4. As a result, Peter had to commit suicide.", "likes": "57% users", "solving_time": "7 minutes", "level": "6/10 medium", "date": "03 March 2018"}
{"story": ["A man is running, a crowd is running after him. The man is screaming to the crowd:\"You will never see the gold!\" and he starts shooting. People who observe all that are exulting."], "answer": ["It was the biathlon. "], "story_keys": "1. A man is running with a crowd chasing him.\n2. The man yells at the crowd that they will never see the gold.\n3. He begins shooting.\n4. Observing people are exhilarated by the unfolding scene.", "answer_keys": "The event was a biathlon.", "likes": "56% users", "solving_time": "7 minutes", "level": "5/10 medium", "date": "18 January 2018"}
{"story": ["Taxi stops, the taxi driver opens the door and a dead men falls on the road. What had happened?"], "answer": ["The previous passenger was a spider lover and he forgot a box with his spider there. This dead men panicked when he saw it and so he was bitten by apoisonous spider."], "story_keys": "1. Taxi stops\n2. The taxi driver opens the door\n3. A dead man falls onto the road\n4. Unclear circumstances around the incident.", "answer_keys": "- The previous passenger was a spider lover who forgot a box with his spider.\n- The current passenger panicked when he saw the spider.\n- The panicking man was bitten by the poisonous spider.", "likes": "56% users", "solving_time": "29 minutes", "level": "6/10 medium", "date": "05 September 2022"}
{"story": ["A woman jumps from a windowshell, on a 6th floor. However, she is not injured in any way."], "answer": ["The woman was about to commit suicide but she changed her mind in the last minute and decided to jump back into her apartment."], "story_keys": "1. A woman jumps from a windowsill on the 6th floor.\n2. She is not injured in any way.", "answer_keys": "1. The woman had suicidal intentions.\n2. She changed her mind at the last minute.\n3. She decided to return to her apartment instead.", "likes": "53% users", "solving_time": "10 minutes", "level": "4/10 medium", "date": "04 March 2018"}
{"story": ["The man received the parcel in which he found a dead mouse. He reported this to the police, and the sender of this parcel was found guilty of fraud."], "answer": ["The sender was supposed to send the jewels to this man. He hoped that the mouse would gnaw a hole in the box and run away, and nobody could blame on him for the loss."], "story_keys": "1. The man received a parcel containing a dead mouse.\n2. He reported the incident to the police.\n3. The sender of the parcel was found guilty of fraud.", "answer_keys": "1. The sender was required to send jewels to a particular man.\n2. The sender hoped that a mouse would gnaw a hole in the box containing the jewels.\n3. The sender planned for the mouse to escape, causing a loss of the jewels.\n4. The sender hoped to avoid blame for the loss of the jewels in this manner.", "likes": "52% users", "solving_time": "19 minutes", "level": "6/10 medium", "date": "20 January 2018"}
{"story": ["A person called the police and told them to ask about John K. Upon arrival at John’s house, the police found him dead. Examining the corpse, the police discovered severe injuries. But the apartment was in perfect order, without any signs of a struggle or break-in."], "answer": ["A driver hit a passerby at night, found his address in the documents, discovered that he lived alone, and took him home."], "story_keys": "1. A person called the police about John K.\n2. The police arrived at John K's house and found him dead.\n3. Police examination revealed John K had severe injuries.\n4. The apartment was in perfect order with no signs of a struggle or a break-in.", "answer_keys": "-A driver hit a passerby at night\n-The driver found the passerby's address in the documents\n-He discovered that the passerby lived alone\n-The driver took the passerby home", "likes": "50% users", "solving_time": "5 minutes", "level": "6/10 medium", "date": "20 January 2018"}
{"story": ["A man smashes Jimmy's luxury car. Althought Jimmy saw his car get smashed he made no attempt to stop the man."], "answer": ["Jimmy and the other man had a bet. It was agreed that the winner of the bet would smash the loser's car. Jimmy lost the bet."], "story_keys": "1. A man smashes Jimmy's luxury car.\n2. Jimmy sees his car being smashed.\n3. Despite witnessing, Jimmy makes no attempt to stop the man.", "answer_keys": "1. Jimmy had a bet with another man. \n2. The agreement of the bet was that the winner would smash the loser's car.\n3. Jimmy lost the bet.", "likes": "50% users", "solving_time": "9 minutes", "level": "4/10 medium", "date": "17 March 2018"}
{"story": ["George was late for a math class and misunderstood the teacher. This brought him a reward and recognition! What happened?"], "answer": ["Once, the American mathematician George Danzig came very late for a class. He saw some problems written on the blackboard and decided that these were a homework task. He spent several days working on them and eventually found the answers. It turned out that he found the key to two “unsolvable” problems that many scientists were wrestling with."], "story_keys": "- George was late for math class\n- He misunderstood the teacher\n- Despite these events, he received a reward and recognition.", "answer_keys": "- American mathematician George Danzig arrived late for a class.\n- He mistook problems on the blackboard for a homework task.\n- Danzig spent several days working on these problems.\n- He eventually found the answers to these problems.\n- It turned out, he solved two \"unsolvable\" problems that many scientists had been wrestling with.", "likes": "50% users", "solving_time": "5 minutes", "level": "4/10 medium", "date": "16 April 2018"}
{"story": ["An artist took an order to paint a portrait of a very ugly and arrogant woman. Everyone tried to dissuade him, claiming that she wouldn’t pay a penny, because the portrait would be bad. And so it happened. But two days later, the woman returned and begged the artist to sell her the portrait. Why?"], "answer": ["The artist sent the portrait to an exhibition and called it The Penny Pincher. It triggered gossips, and the woman had to ask the artist to remove the portrait from the exhibition."], "story_keys": "-An artist was commissioned to paint a portrait of an ugly, arrogant woman\n-People warned him she wouldn't pay because the portrait would be unflattering\n-The woman didn't pay initially \n-Two days later, she came back and asked the artist to sell her the portrait.", "answer_keys": "- The artist sent a portrait to an exhibition labeled as \"The Penny Pincher\".\n- The portrait became a subject of gossip.\n- The woman depicted in the portrait requested the artist to remove it from the exhibition.", "likes": "50% users", "solving_time": "5 minutes", "level": "6/10 medium", "date": "16 April 2018"}
{"story": ["A dinner at a dormitory. The light went out. When they turned on the light, a student had blood all over his hands."], "answer": ["There was the last sausage left on the plate. When the light went out, all the students reached for the sausage with their forks, and this one with his hands."], "story_keys": "1. A dinner was occurring at a dormitory.\n2. The light in the dormitory went out.\n3. When the light was turned back on, a student was found with blood on his hands.", "answer_keys": "- There was one last sausage left on a plate.\n- The light went out.\n- All the students used forks to try to get the last sausage.\n- One student used his hands to reach for the sausage.", "likes": "50% users", "solving_time": "5 minutes", "level": "6/10 medium", "date": "25 August 2019"}
{"story": ["Gabriela's decision to stop moving saved her life."], "answer": ["Gabriela was in a swamp and found herself stuck in quicksand. She moved slowly so that she could wait until somebody rescued her."], "story_keys": "- Gabriela made a decision to stop moving which resulted in saving her life.", "answer_keys": "- Gabriela was in a swamp and got stuck in quicksand.\n- She moved slowly to avoid sinking further.\n- She was waiting for someone to rescue her.", "likes": "50% users", "solving_time": "7 minutes", "level": "4/10 medium", "date": "28 April 2023"}
{"story": ["Alexander shot at the king, but no one condemned him. Why?"], "answer": ["Alexander played poker and lost. Out of anger he shot at the card depicting the king."], "story_keys": "1. Alexander shot at the king.\n2. No one condemned Alexander for his actions. \n3. The reason for no condemnation is questioned.", "answer_keys": "- Alexander played poker and lost.\n- In his anger, Alexander shot at the card depicting the king.", "likes": "50% users", "solving_time": "5 minutes", "level": "4/10 medium", "date": "20 May 2023"}
{"story": ["You are driving down the road in your car on a wild, stormy night, when you pass by a bus stop and you see three people waiting for the bus: An old lady, an old friend who once saved your life and the perfect partner you have been dreaming about. There can only be one passenger in your car, whom do you choose?"], "answer": ["The old lady of course! After helping the old lady into the car, you can give your keys to your friend and have him drive the old lady. You get to wait for the next bus with your perfect partner."], "story_keys": "- The speaker is driving on a stormy night.\n- They pass by a bus stop with three people waiting: an old lady, a life-saving old friend, and their dream partner.\n- The car can only accommodate one more passenger.\n- The speaker must choose which person to give a ride.", "answer_keys": "1. The subject is helping an old lady into a car.\n2. After helping the old lady, the subject will give their car keys to a friend.\n3. The friend will then drive the old lady.\n4. Subject will wait for the next bus with another individual described as their perfect partner.", "likes": "50% users", "solving_time": "2 minutes", "level": "5/10 medium", "date": "06 November 2023"}
{"story": ["The woman is speaking something and she is upset. Nobody can understand her but a man is filming her on camera. Why? And what is happening? "], "answer": [], "story_keys": "- A woman is speaking something while appearing upset.\n- No one is able to understand her. \n- A man is capturing her on camera.\n- The reasons and the context of this scenario are unclear.", "answer_keys": "You didn't provide a sentence to analyze. Could you please provide one?", "likes": "42% users", "solving_time": "39 minutes", "level": "5/10 medium", "date": "27 January 2018"}
{"story": ["A man buys rice at $1 a pound from American growers and sells it for 2 cents a pound. As a result of this he becomes a millionaire. How could this be?"], "answer": ["The man is a philanthropist who bought the rice to sell to poor people at prices they could afford. He started out as a billionaire, but lost so much money in his good works that he became a millionaire! (this is Warren Buffets goal)"], "story_keys": "- A man buys rice at $1 a pound from American growers.\n- He sells the rice for 2 cents a pound.\n- He becomes a millionaire from this process. \n- It's unclear how this could be possible.", "answer_keys": "- The man is a philanthropist.\n- He bought rice to sell to poor people at affordable prices.\n- The man started as a billionaire but turned into a millionaire due to his philanthropic works.\n- This is akin to the goal of Warren Buffet.", "likes": "40% users", "solving_time": "15 minutes", "level": "6/10 medium", "date": "06 November 2023"}
{"story": ["A woman asks questions to her friend - a policeman - about a strange death. After 5 minutes the policeman is surprised to see that the woman finds out the cause of the death."], "answer": ["The woman and the policeman were friends and they were playing \"situation puzzle\". The policeman told a story and thought that his friend could not solve it. He was very surprised when the woman, after a few questions, found out the solution. "], "story_keys": "1. A woman is speaking with her friend who is a policeman.\n2. They are discussing a strange death.\n3. After 5 minutes, the woman identifies the cause of the death.\n4. The policeman is surprised by the woman's deduction.", "answer_keys": "- The woman and the policeman are friends.\n- They were playing a \"situation puzzle\" game. \n- The policeman told a story, thinking his friend wouldn't be able to solve it.\n- The woman solved the puzzle to the policeman's surprise.", "likes": "37% users", "solving_time": "27 minutes", "level": "5/10 medium", "date": "17 March 2018"}
{"story": ["A man was born in 1972 and dies in 1952 at the age of 25. How can this be?"], "answer": ["He's born in room number 1972 of a hospital and dies in room number 1952."], "story_keys": "The key point of the sentence is a logical inconsistency: a man is stated to have been born in 1972, died in 1952, yet was 25 years old at the time of death, indicating a possible error or riddle.", "answer_keys": "The man was born in room number 1972 and died in room number 1952 of a hospital.", "likes": "37% users", "solving_time": "6 minutes", "level": "5/10 medium", "date": "07 November 2023"}
{"story": ["The cadets became the cause of a mass buying up of salt in the whole city."], "answer": ["Cadets were supposed to shovel the snow. But they were lazy so they strew the ground with salt. They bought lots of salt to perfrom it. When old people saw military men buying lots of salt, they thought there'll be a war soon and began to wreak havoc and buy up salt. "], "story_keys": "- Cadets initiated a mass purchase of salt in the entire city.", "answer_keys": "1. Cadets were expected to shovel the snow.\n2. The cadets chose to spread salt on the ground due to laziness.\n3. They purchased a large amount of salt to carry out this task.\n4. Elderly people, upon seeing the cadets buying a lot of salt, presumed it was a sign of an impending war.\n5. This assumption led to panic and caused them to begin hoarding salt.", "likes": "33% users", "solving_time": "7 minutes", "level": "4/10 medium", "date": "04 March 2018"}
{"story": ["Why is it better to have round manhole covers than square ones?"], "answer": ["A square manhole cover can be turned and dropped down the diagonal of the manhole. A round manhole cover cannot be dropped down the manhole. So for safety reasons, all manhole covers should be round."], "story_keys": "The key point is the inquiry about the reason behind preferring round manhole covers over square ones.", "answer_keys": "1. A square manhole cover can fall through the manhole if turned diagonally.\n2. A round manhole cover cannot fall through the manhole.\n3. For safety reasons, all manhole covers should be round.", "likes": "33% users", "solving_time": "5 minutes", "level": "4/10 medium", "date": "23 July 2023"}
